{
    "id": "8d841f7f49e033711d3d4284e45d6e5dd1bbda9bee279295e0995c84f3eb2741",
    "title": "Seeing AI as a collaborator, not a creator",
    "link": "https://www.technologyreview.com/2025/04/23/1114891/editors-letter-creativity-art-ai-collaboration-humanity-technology/",
    "published_iso": "2025-04-23T09:00:00Z",
    "summary": "<p>The reason you are reading this letter from me today is that I was bored 30 years ago.&nbsp;</p>\n\n\n\n<p>I was bored and curious about the world and so I wound up spending a lot of time in the university computer lab, screwing around on Usenet and the early World Wide Web, looking for interesting things to read. Soon enough I wasn’t content to just read stuff on the internet—I wanted to make it. So I learned HTML and made a basic web page, and then a better web page, and then a whole website full of web things. And then I just kept going from there. That amateurish collection of web pages led to a journalism internship with the online arm of a magazine that paid little attention to what we geeks were doing on the web. And that led to my first real journalism job, and then another, and, well, eventually <em>this</em> journalism job.&nbsp;</p>\n\n\n\n<p>But none of that would have been possible if I hadn’t been bored and curious. And more to the point: curious about tech.&nbsp;</p>\n\n\n\n<p>The university computer lab may seem at first like an unlikely center for creativity. We tend to think of creativity as happening more in the artist’s studio or writers’ workshop. But throughout history, very often our greatest creative leaps—and I would argue that the web and its descendants represent one such leap—have been due to advances in technology.&nbsp;</p>\n\n\n\n<p>There are the big easy examples, like photography or the printing press, but it’s also true of all sorts of creative inventions that we often take for granted. Oil paints. Theaters. Musical scores. Electric synthesizers! Almost anywhere you look in the arts, perhaps outside of pure vocalization, technology has played a role. &nbsp;</p>\n\n\n\n<p>But the key to artistic achievement has never been the technology itself. It has been the way artists have applied it to express our humanity. Think of the way we talk about the arts. We often compliment it with words that refer to our humanity, like <em>soul</em>, <em>heart</em>, and <em>life</em>; we often criticize it with descriptors such as <em>sterile</em>, <em>clinical</em>, or <em>lifeless</em>. (And sure, you can love a sterile piece of art, but typically that’s because the artist has leaned into sterility to make a point about humanity!)</p>\n\n\n\n<p>All of which is to say I think that AI can be, will be, and already is a tool for creative expression, but that true art will always be something steered by human creativity, not machines.&nbsp;</p>\n\n\n\n<p>I could be wrong. I hope not.&nbsp;</p>\n\n\n\n<p>This issue, which was entirely produced by human beings using computers, explores creativity and the tension between the artist and technology. You can see it on our cover illustrated by Tom Humberstone, and read about it in stories from <a href=\"https://www.technologyreview.com/2025/04/16/1114433/ai-artificial-intelligence-music-diffusion-creativity-songs-writer/\">James O’Donnell</a>, <a href=\"https://www.technologyreview.com/2025/04/10/1114256/ai-creativity-art-collaboration-music/\">Will Douglas Heaven</a>, <a href=\"https://www.technologyreview.com/2025/04/11/1114266/artificial-intelligence-book-reviews-vauhini-vara-david-hajdu-pria-anand/\">Rebecca Ackermann</a>, <a href=\"https://www.technologyreview.com/2025/04/22/1114874/generative-ai-south-korea-webcomics/\">Michelle Kim</a>, <a href=\"https://www.technologyreview.com/2025/04/18/1114478/cult-of-creativity-samuel-franklin-book-technology-ai/\">Bryan Gardiner</a>, and <a href=\"https://www.technologyreview.com/2025/04/21/1114764/ai-artificial-intelligence-architecture-building/\">Allison Arieff</a>.&nbsp;</p>\n\n\n\n<p>Yet of course, creativity is about more than just the arts. All of human advancement stems from creativity, because creativity is how we solve problems. So it was important to us to bring you accounts of that as well. You’ll find those in stories from <a href=\"https://www.technologyreview.com/2025/04/18/1114464/bitcoin-mining-heat-spas-water-climate-warming/\">Carrie Klein</a>, <a href=\"https://www.technologyreview.com/2025/04/09/1114252/new-bird-flu-sensor-disease-outbreaks/\">Carly Kay</a>, <a href=\"https://www.technologyreview.com/2025/04/21/1114759/maldives-erosion-climate-dredging/\">Matthew Ponsford</a>, and <a href=\"https://www.technologyreview.com/2025/04/14/1114306/space-nuclear-explosion-asteroid-protection-research/\">Robin George Andrews</a>. (If you’ve ever wanted to know how we might nuke an asteroid, this is the issue for you!) &nbsp;</p>\n\n\n\n<p>We’re also trying to get a little more creative ourselves. Over the next few issues, you’ll notice some changes coming to this magazine with the addition of some new regular items (see <a href=\"https://www.technologyreview.com/2025/04/23/1114885/caiwei-chen-ai-openai-play-dinner-parties-sewing/\">Caiwei Chen’s “3 Things”</a> for one such example). Among those changes, we are planning to solicit and publish more regular reader feedback and answer questions you may have about technology. We invite you to get creative and email us: <a href=\"mailto:newsroom@technologyreview.com\">newsroom@technologyreview.com</a>.</p>\n\n\n\n<p>As always, thanks for reading.</p>",
    "source_feed": "https://www.technologyreview.com/topic/artificial-intelligence/feed/",
    "scraped_at_iso": "2025-05-02T08:05:42Z"
}