{
    "id": "d5a45e35e9c927001c9b1f8ef5a46a669e2bd720e9355989bc8163f69ca11594",
    "title": "We need to start thinking of AI as “normal”",
    "link": "https://www.technologyreview.com/2025/04/29/1115928/is-ai-normal/",
    "published_iso": "2025-04-29T09:00:00Z",
    "summary": "<p>Right now, despite its ubiquity, AI is seen as anything but a normal technology. There is talk of AI systems that will soon merit the term “<a href=\"https://www.technologyreview.com/2025/03/11/1112983/agi-is-suddenly-a-dinner-table-topic/\">superintelligence</a>,” and the former CEO of Google recently suggested we control AI models the way we control uranium and other nuclear weapons materials. Anthropic is dedicating time and money to study AI “<a href=\"https://techcrunch.com/2025/04/24/anthropic-is-launching-a-new-program-to-study-ai-model-welfare/\">welfare</a>,” including what rights AI models may be entitled to. Meanwhile, such models are moving into disciplines that feel distinctly human, from making <a href=\"https://www.technologyreview.com/2025/04/16/1114433/ai-artificial-intelligence-music-diffusion-creativity-songs-writer/\">music</a> to providing <a href=\"https://www.technologyreview.com/2025/03/28/1114001/the-first-trial-of-generative-ai-therapy-shows-it-might-help-with-depression/\">therapy</a>.</p>\n\n\n\n<p>No wonder that anyone pondering AI&#8217;s future tends to fall into either a utopian or a dystopian camp. While OpenAI’s Sam Altman <a href=\"https://x.com/sama/status/1913320105804730518\">muses</a> that AI’s impact will feel more like the Renaissance than the Industrial Revolution, over <a href=\"https://www.pewresearch.org/internet/2025/04/03/how-the-us-public-and-ai-experts-view-artificial-intelligence/\">half</a> of Americans are more concerned than excited about AI’s future. (That half includes a few friends of mine, who at a party recently speculated whether AI-resistant communities might emerge—modern-day Mennonites, carving out spaces where AI is limited by choice, not necessity.)&nbsp;</p>\n\n\n\n<p>So against this backdrop, a recent <a href=\"https://knightcolumbia.org/content/ai-as-normal-technology\">essay</a> by two AI researchers at Princeton felt quite provocative. Arvind Narayanan, who directs the university’s Center for Information Technology Policy, and doctoral candidate Sayash Kapoor wrote a 40-page plea for everyone to calm down and think of AI as a normal technology. This runs opposite to the “common tendency to treat it akin to a separate species, a highly autonomous, potentially superintelligent entity.”</p>\n\n\n\n\n\n<p>Instead, according to the researchers, AI is a general-purpose technology whose application might be better compared to the drawn-out adoption of electricity or the internet than to nuclear weapons—though they concede this is in some ways a flawed analogy.</p>\n\n\n\n<p>The core point, Kapoor says, is that we need to start differentiating between the rapid development of AI <em>methods</em>—the <a href=\"https://www.technologyreview.com/2024/08/27/1103035/a-skeptics-guide-to-humanoid-robot-videos/\">flashy</a> and impressive displays of what AI can do in the lab—and what comes from the actual <em>applications</em> of AI, which in historical examples of other technologies lag behind by decades.&nbsp;</p>\n\n\n\n<p>“Much of the discussion of AI’s societal impacts ignores this process of adoption,” Kapoor told me, “and expects societal impacts to occur at the speed of technological development.” In other words, the adoption of useful artificial intelligence, in his view, will be less of a tsunami and more of a trickle.</p>\n\n\n\n<p>In the essay, the pair make some other bracing arguments: terms like “superintelligence” are so incoherent and speculative that we shouldn’t use them; AI won’t automate everything but will birth a category of human labor that monitors, verifies, and supervises AI; and we should focus more on AI’s likelihood to worsen current problems in society than the possibility of it creating new ones.</p>\n\n\n\n<p>“AI supercharges capitalism,” Narayanan says. It has the capacity to either help or hurt inequality, labor markets, the free press, and democratic backsliding, depending on how it&#8217;s deployed, he says.&nbsp;</p>\n\n\n\n<p>There’s one alarming deployment of AI that the authors leave out, though: the use of AI by militaries. That, of course, is <a href=\"https://www.technologyreview.com/2025/04/15/1115078/phase-two-of-military-ai-has-arrived/\">picking up</a> rapidly, raising alarms that life and death decisions are increasingly being aided by AI. The authors exclude that use from their essay because it’s hard to analyze without access to classified information, but they say their research on the subject is forthcoming.&nbsp;</p>\n\n\n\n<p>One of the biggest implications of treating AI as “normal” is that it would upend the position that both the Biden administration and now the Trump White House have taken: Building the best AI is a national security priority, and the federal government should take a range of actions—limiting what chips can be exported to China, dedicating more energy to data centers—to make that happen. In their paper, the two authors refer to US-China “AI arms race” rhetoric as “shrill.”</p>\n\n\n\n<p>“The arms race framing verges on absurd,” Narayanan says. The knowledge it takes to build powerful AI models spreads quickly and is already being undertaken by researchers around the world, he says, and “it is not feasible to keep secrets at that scale.”&nbsp;</p>\n\n\n\n<p>So what policies do the authors propose? Rather than planning around sci-fi fears, Kapoor talks about “strengthening democratic institutions, increasing technical expertise in government, improving AI literacy, and incentivizing defenders to adopt AI.”&nbsp;</p>\n\n\n\n<p>By contrast to policies aimed at controlling AI superintelligence or winning the arms race, these recommendations sound totally boring. And that’s kind of the point.</p>\n\n\n\n<p><em>This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first,&nbsp;<a href=\"https://forms.technologyreview.com/newsletters/ai-demystified-the-algorithm/\">sign up here</a>.</em></p>",
    "source_feed": "https://www.technologyreview.com/topic/artificial-intelligence/feed/",
    "scraped_at_iso": "2025-05-02T08:05:42Z"
}