{
    "id": "8014b1e0f6bab90cb6f12e0effa0b66a81053f2691aaec9cd8690385f1e3b578",
    "title": "The best robot vacuums",
    "link": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
    "published_iso": "2025-05-05T22:16:04Z",
    "summary": "<figure>\n\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/257605_best_budget_robot_vacuums_CVirginia.jpg?quality=90&strip=all&crop=0,0,100,100\" />\n\t<figcaption></figcaption>\n</figure>\n<p class=\"has-text-align-none\">Robot vacuums are impressive devices that will clean your floors well and — thanks to bigger batteries and better robot brains — rarely get tired of doing their job. Over the last few years, they have gone from being utilitarian devices that sweep your floor to <a href=\"https://www.theverge.com/2025/1/12/24340818/robot-vacuum-innovations-roborock-dreame-ecovacs-ces2025\">full-fledged home robots</a> that can vacuum and mop your home and then trundle off to clean themselves to be ready for the next run. </p>\n\n<div class=\"wp-block-vox-media-highlight vox-media-highlight alignnone\">\n<h3 class=\"wp-block-heading\"> </h3>\n\n\n\n<div class=\"wp-block-vox-media-table-of-contents\"><ol><li><a href=\"https://www.theverge.com/rss/index.xml#JOgEaJ\">Best robot vacuum</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#best-budget-robot-vacuum\">Best budget robot vacuum</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#lcAsTN\">Best mopping robot vacuum for hard floors</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#best-robot-vacuum-mop-hybrid\">Best robot vacuum / mop hybrid</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#cxWX29\">Best midrange robot vacuum / mop </a></li><li><a href=\"https://www.theverge.com/rss/index.xml#T62d06\">Best robot vacuum for pet hair</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#tC6uGA\">Other robot vacuums to consider</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#wJlydD\">What I’m testing and what’s coming next</a></li><li><a href=\"https://www.theverge.com/rss/index.xml#UZYu04\">How I test robot vacuums</a></li></ol></div>\n</div>\n\n<p>I’ve been testing robot vacuums for seven years and have run over 70 robot vacuums all over my house. These are my top picks if you’re looking for the best: a robot vacuum that can do it all with limited intervention from you.</p>\n\n<p>Along with my top picks, I have options to fit specific needs, such as mopping or besting pet hair. The good news is there are a lot of great options. Whether you have a 3,000-square-foot home and three shaggy dogs or a small, stylish apartment you share with a goldfish, there’s a robot vacuum to suit your needs. </p>\n\n<div class=\"wp-block-vox-media-methodology-accordion\"><div class=\"wp-block-vox-media-methodology-accordion\">\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Superior cleaning power</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">It’s not all about suction. In my testing, the brush is also a big factor in how well a robot will clean your floors. A large rubber roller brush is much better than a small bristle brush at picking up debris. It’s also less prone to getting tangled up with hair. Two brushes are better than one, and a brush housing that has some flexibility — so it can move with the contours of the floor — is also more effective.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Mopping prowess</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">It’s hard to find a robot vac that doesn’t have some form of mopping, but not all mops are created equal. I looked for mopping bots that could get up dried-on stains, like milk and ketchup, and scrub up small wet spills without messing themselves up. Oscillating, spinning, or vibrating mop pads clean better than bots that just drag a wet rag around, but the new self-cleaning roller mops that are beginning to appear are even more effective. Auto-carpet sensing is also important since it prevents the robot from accidentally mopping your rug.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">A big bin…</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">A big bin means you don’t need to empty it as often. The largest I’ve seen is 800ml, but anything over 500ml is decent. With many bots now pulling double duty as mopping robots, plus the popularity of self-empty dock / charging bases, it’s getting harder to find small robot vacs with big bins. But they’re worth considering — especially if you have carpets and pets. I love self-empty docks, but sometimes you don’t have space for them, and if you like your robot to be out of sight (living under your bed or sofa), you’ll want a big bin and no dock.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">… Or a self-empty dock</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">These are becoming standard now and coming down in price (thankfully). A self-empty dock turns the charging base for your robot into a motorized emptying station that sucks out the dirt from its bin. (Warning: this process can be loud!) This saves you from having to pull out the bin after every few runs and empty it yourself. Instead, you’ll have to replace the bag (and buy new ones) when it gets full, generally about once a month. Many robots now have a self-empty dock option you can add later, although buying them together is generally cheaper.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">AI-powered obstacle detection</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">Another nice-to-have feature, AI-powered obstacle detection helps your robot “intelligently” detect and avoid clutter (and a <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">potential poop apocalypse if it encounters pet waste</a>). These models use cameras (worth noting) to see objects in their path and onboard processors to “decide” how to approach them based on what they see. All AI is not created equal, however, and some are much better at this than others. The end result is that robot vacuums with AI detection are less likely to get stuck when cleaning, so you’re more likely to come home to a clean floor rather than a beached bot.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Reliable mapping</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">A robot that maps your house will get into every nook and cranny better than one that bumps and rolls around. Mapping also lets you send the robot to clean specific rooms rather than the whole space and add virtual walls to prevent your bot from going where you don’t want it to. These are crucial<strong> </strong>if you have delicate objects or areas in your home that regularly trap robots. Most robots use variations on <a href=\"https://www.mathworks.com/discovery/slam.html\">simultaneous localization and mapping (SLAM) technology</a>, such as <a href=\"https://www.faro.com/en/Resource-Library/Article/What-is-SLAM#:~:text=What%20Is%20Lidar%20SLAM%3F,Time%20of%20Flight%20(ToF)\">lidar</a> or <a href=\"https://www.automate.org/vision/blogs/what-is-visual-slam-technology-and-what-is-it-used-for\">vSLAM</a>.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Easy-to-use app and voice control</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">A good app has easy controls to stop and start your vacuum, scheduling options (including do-not disturb hours), plus good mapping features. Nice-to-have features are room-specific cleaning and settings (so you can tell your vacuum to clean the kitchen or have it mop and vacuum the kitchen but only vacuum the living room). My biggest frustration with apps is maps that are fiddly to update and / or crash and must be rebuilt constantly. Most vacuums now have voice control (see FAQs), but some offer more in-depth control, such as telling Alexa to have the robot clean twice under the dining room table.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Good battery life</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">Nearly all robot vacuums can “recharge and resume” — take themselves back to their dock when they’re low and recharge before picking up where they left off. But a vacuum with at least 120 minutes of runtime (180 is ideal) will clean the whole house in one go. If it takes too long, noisy robots that are constantly running will get shut off by annoyed family members who aren’t about to clean the room for you.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Repairability</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">Robot vacuums are quite an investment, and it’s important to be able to buy replacement parts to keep them going for longer and have access to good support in case your robot has a serious issue.<br /></p>\n</div></div>\n</div></div>\n\n<h2 class=\"wp-block-heading\" id=\"JOgEaJ\">Best robot vacuum</h2>\n\n<p><em><em><strong>Dustbin capacity: </strong>270ml<strong> </strong>/ <strong>Self-empty dock option: </strong>Yes<strong> </strong>/ <strong>Auto-refill mop option: </strong>Yes<strong> / Mop lift: </strong>Yes, 20mm <strong>/</strong> <strong>Mop washing</strong>: Hot water and heated air drying <strong>/ Mapping: </strong>Yes, lidar / <strong>AI-powered obstacle detection: </strong>Yes / <strong>Suction power:</strong> 10,000Pa <strong>/ Remote check-in:</strong> Yes<strong> / Keep-out zones: </strong>Yes, virtual / <strong>Brush style: </strong>Dual rubber<strong> </strong>/ <strong>Works with: </strong>Amazon Alexa, Google Home, Siri Shortcuts</em></em>,<em><strong> </strong>Apple Home via Matter</em></p>\n\n<p>Roborock’s <a href=\"https://us.roborock.com/pages/roborock-s8-maxv-ultra\">S8 MaxV Ultra</a> ($1,799.99) is an exceptional vacuum cleaner and a very good mop. Its dual rubber roller brushes and 10,000Pa suction make it great on carpets; its sonic mopping is very good on hard floors, and its improved AI-powered obstacle detection means it will most likely get the job done without getting trapped or derailed.</p>\n\n<p>The S8 MaxV Ultra is the best in the category of “hands-free” robot vacs, bots that do virtually everything for you: empty their bins, refill their mop tanks, and clean and dry their mop pads. Roborock invented this category with the <a href=\"https://www.theverge.com/22960447/roborock-s7-maxv-ultra-review-robot-vacuum-mop-hybrid\">S7 MaxV Ultra</a> and has been steadily improving it.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25406962/247088_Roborock_vs_DreameBot_JTuohy_0010.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<p>That’s the big selling point here; this bot is basically hands-free. Fill the S8 MaxV Ultra’s clean water tank and empty its dirty water once a week and change out the dust bag every couple of months. The robot will take care of the rest.</p>\n\n<p>For $100 more, you can dispense with dealing with the water tanks entirely and buy the <a href=\"https://us.roborock.com/products/roborock-s8-maxv-ultra-with-refill-drainage-system\">Refill & Drainage System</a> model. This lets you plumb the charging base directly into your home’s water supply. I’ve not tested this on the Roborock, but my experience with the <a href=\"https://www.theverge.com/24144618/switchbot-s10-review-robot-vacuum\">SwitchBot S10</a> with the same feature leads me to recommend this option if you can swing it.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25405367/247088_Roborock_vs_DreameBot_JTuohy_0008.jpg?quality=90&strip=all&crop=0,32.547993019197,100,34.904013961606\" title=\"\" />\n<p>The S8 MaxV Ultra comes with excellent AI-powered obstacle detection, bringing back the camera it last had on the S7 MaxV Ultra. It’s not quite as good as Roomba’s obstacle detection — it sometimes confused a pile of Cheerios for a charging cable and avoided them — but it’s much better than the Roborocks that rely on non-camera obstacle detection. It deftly navigates around most household clutter, allowing you to get the job done without having to tidy up.</p>\n\n<p>Roborock has caught up to Roomba on cleaning prowess, and the S8 MaxV Ultra’s dual rubber brushes and 10,000Pa of suction power tackled the pet hair on my fluffy carpet and demolished my oatmeal test. </p>\n\n<p>It also did a better job at mopping than Roomba’s mopping bots, though not quite as well as the Narwal Freo X Ultra or Dreame X40 Ultra, though it’s a better vacuum than either. </p>\n\n<p>Its sonic mopping system — which vibrates its mop pad 4,000 times a minute — ably simulated scrubbing and wiped out my OJ and ketchup tests, though I did have to set it to deep scrub. Plus, the addition of a side mop and flexi-arm brush that extends from the bot helped with cleaning edges and corners.</p>\n\n<p>Roborock’s mobile app is easy to use and comes with a laundry list of features and customizations that give you ample control over your cleaning. The S8 MaxV Ultra also has a built-in voice assistant, which makes getting the bot to clean the mess your kid made after dinner as easy as saying, “Rocky, clean here.” </p>\n\n<p>Roborock also sells the <a href=\"https://us.roborock.com/products/roborock-s8-max-ultra\">S8 Max Ultra</a> (no V) for $1,599.99. It has the same cleaning hardware as the MaxV but no camera, so its obstacle detection will not be as good. However, you also don’t have to worry about a camera in your house. It has a lower 8,000Pa of suction and lacks a voice assistant, too, which makes it seem overpriced since it’s currently only a couple hundred dollars less than the MaxV.</p>\n\n<p>There are several great vacuum / mop hybrids in this guide. Of them, the S8 MaxV Ultra is the best at vacuuming and obstacle detection, and it’s a very good mop. It can also do both in one run, as it can lift its mop 20mm, which will clear all but the highest-pile rugs. If you have a lot of those, go for the Dreame X40, with its automatic mop removal. Its vacuuming and object detection are a notch below the Roborock’s, but its mopping is a notch above. The Narwal Freo X Ultra is an even better mop than the Dreame, but its obstacle detection isn’t great, and its vacuuming is merely pretty good.</p>\n\n<h5 class=\"wp-block-heading\" id=\"VGFl7c\"><a href=\"https://www.theverge.com/24141479/roborock-s8-maxv-ultra-vs-dreame-x30-ultra-robot-vacuum-mop\">Read my Roborock S8 MaxV Ultra review</a>.</h5>\n\n<h2 class=\"wp-block-heading has-text-align-none\" id=\"best-budget-robot-vacuum\">Best budget robot vacuum</h2>\n\n<p class=\"has-text-align-none\"><em><em><strong>Dustbin capacity: </strong>300ml<strong> </strong>/ <strong>Self-empty dock option: </strong>Yes<strong> </strong>/ <strong>Auto-refill mop option: </strong>No<strong> / Mop lift: </strong>No <strong>/</strong> <strong>Mop washing</strong>: No <strong>/  Mapping: </strong>Yes, lidar<strong> </strong>/ <strong>AI-powered obstacle detection: </strong>No / <strong>Suction power:</strong> 5,300Pa<strong> / <em><em><strong>Remote check-in:</strong> </em></em></strong><em><em>No</em></em><em><em> </em></em></em>/</em> <em><em><strong>Keep-out zones: </strong>Yes, virtual / <strong>Brush style: </strong>Single rubber bristle hybrid<strong> </strong>/ <strong>Works with: </strong>Amazon Alexa, Google Home, Siri Shortcuts</em></em></p>\n\n<p class=\"has-text-align-none\">For around $300, the Tapo RV30 Max Plus is a very capable robot vacuum and mop with some key features usually only found on vacuums that are more than twice its price. These include room-specific cleaning, multiple suction and water levels, smart lidar-based navigation, and an auto-empty dock. With brands like Roomba and Roborock, you’re often paying double for the privilege of not having to empty the bot’s bin.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/8A0A2475.jpeg?quality=90&strip=all&crop=0,32.547993019197,100,34.904013961606\" title=\"\" />\n<p class=\"has-text-align-none\">Thanks to lidar navigation, the RV30 did an excellent job of navigating my house, cleaning the perimeters of the rooms, and then using a mesh grid to clean inside the rooms. I did have to tidy up before it ran, though, as there’s no camera on board or AI-powered obstacle detection — so cables and socks will trip it up. </p>\n\n<p class=\"has-text-align-none\">Its 5,200Pa suction power is impressive on a bot at this price, and ably sucked up Cheerios and dry oatmeal on hard flooring. It left some of the finer dust and debris, as its single bristle / rubber brush isn’t super effective. It fared less well on carpet. However, in the app, I could set it to clean a room three times for each job, after which it had generally picked up all visible debris.</p>\n\n<p class=\"has-text-align-none\">Mopping was better than average for a mop with no pressure or oscillation. It has a wide mop pad, and the bot has a big 300ml tank (which also incorporates a 300ml dustbin), so it applies enough water to do a good surface clean.</p>\n\n<p class=\"has-text-align-none\">Another unique feature for a budget robot is the ability to set customized cleaning for each room, choosing from five suction levels and three water levels as well as the three rotations.</p>\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>5,200Pa suction power is impressive on a bot at this price</p></blockquote></figure>\n\n<p class=\"has-text-align-none\">The Tapo app is very simple to use, with an easy-to-edit map that lets you add virtual walls and no-go zones, add furniture, and designate carpet areas. There’s no carpet sensing, so you need to tell it where carpets are if you don’t want it to mop them. You can even set the cleaning direction and build up to four maps — again, features usually only found on higher-end robots.</p>\n\n<p class=\"has-text-align-none\">It’s also super easy to start a clean, and I really like that you can just tap on the map to send the robot to that spot. The biggest downside of the Tapo is its tiny battery, which is just 2,600mAh. That is half the size of most vacs, and it couldn’t clean my entire 800-square-foot downstairs without needing to go back and recharge. It also takes a while to charge and occasionally had trouble repositioning itself on its dock. You can get the RV30 without the auto-empty dock for around $80 less if you prefer an even simpler robot vacuum setup. This way, it will fit under a couch or bed, but you’ll have to manually empty its bin.</p>\n\n<h2 class=\"wp-block-heading\" id=\"lcAsTN\">Best mopping robot vacuum for hard floors</h2>\n\n<p><em><em><strong>Dustbin capacity: </strong>1L<strong> </strong>/ <strong>Self-empty dock option: </strong>No<strong> </strong>/ <strong>Auto-refill mop option: </strong>Yes<strong> / Mop lift: </strong>Yes, 12mm <strong>/</strong> <strong>Mop washing</strong>: Yes, hot air drying <strong>/  Mapping: </strong>Yes, lidar<strong> </strong>/ <strong>AI-powered obstacle detection: </strong>Yes / <strong>Suction power:</strong> 8,200Pa <strong>/ Remote check-in:</strong> No<strong> / Keep-out zones: </strong>Yes, virtual / <strong>Brush style: </strong>Single, conical rubber bristle hybrid<strong> </strong>/ <strong>Works with: </strong>Amazon Alexa, Google Home, Siri Shortcuts</em></em></p>\n\n<p>The Narwal Freo X Ultra is one of the best mopping robots I’ve tested — and it’s a good vacuum, too. Its spinning triangular mop pads rotate at 180RPM with 12n of downward pressure. Combined with its ability to swing slightly to get closer to baseboards, the Narwal does a very good job on hard floors. Its dual four-liter water tanks will keep you going longer than most other mopping bots as well, the majority of which feature smaller tanks.</p>\n\n<p>The Narwal has some innovative features, including dirt sense — which analyzes the dirt level in the water and prompts it to remop — and an ability to adapt the pressure of its mop based on the type of floor, applying more pressure to tile and less to hardwood. “Freo” refers to the bot’s ability to make cleaning “decisions,” including going back to clean dirty floors.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25350586/8A0A1093.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<p>Its charging dock is very big, though, giving off a real Wall-E vibe. But despite the size, there’s no spot for an auto-empty dustbin; instead, Narwal’s disposable onboard bin compresses the dust, and Narwal claims you won’t need to empty it for up to 60 days. It wasn’t close to full after two weeks of testing. A bonus here is that there’s no loud noise, as is the case with most auto-empty docks.</p>\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>Its charging dock is very big, giving off a real Wall-E vibe</p></blockquote></figure>\n\n<p>In fact, the Freo X Ultra is one of the quietest bots I’ve tested. Even at full power, it was so quiet that I had to check that it was working. Its anti-tangle brush and 8,200Pa suction did a good job on most carpet, but its 12mm mop lifting isn’t good for plush carpets.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25350587/8A0A1090.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<p>Narwal’s obstacle detection is also only okay; there’s no camera, and it routinely eats cables. Its three lasers can identify objects as small as a sock and move around them, and it did pass my fake pet poop test.</p>\n\n<p>The app is very hard to follow, making it tricky to access all of the bot’s features. Mapping was fast, but it didn’t recognize all my rooms on the first go. It did better the second time, although splitting up rooms and naming them in the app was painful. The lack of a camera also means its navigation is spotty, and sending it to clean specific rooms wasn’t always successful. But if you’ve got a lot of hard floors to keep clean, it will do an excellent job.</p>\n\n<h2 class=\"wp-block-heading has-text-align-none\" id=\"best-robot-vacuum-mop-hybrid\">Best robot vacuum / mop hybrid</h2>\n\n<p><em><em><strong>Dustbin capacity: </strong>300ml<strong> </strong>/ <strong>Self-empty dock option: </strong>Yes<strong> </strong>/ <strong>Auto-refill mop option: </strong>Yes<strong> / Mop-lift: </strong>Yes, 20mm <strong>/</strong> <strong>Mop washing</strong>: Hot water, hot air drying <strong>/  Mapping: </strong>Yes, lidar<strong> </strong>/ <strong>AI-powered obstacle detection: </strong>Yes / <strong>Suction power:</strong> 12,000Pa <strong>/ Remote check-in:</strong> Yes<strong> / Keep-out zones: </strong>Yes, virtual / <strong>Brush style: </strong>Single, rubber<strong> </strong>/ <strong>Works with: </strong>Amazon Alexa, Google Home, Siri Shortcuts </em></em></p>\n\n<p>The Dreame X40 is the best robot vacuum / mop hybrid because it can drop its mop pads automatically, extend them, and swing them to get under your cabinets and consoles. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it. That’s impressive.</p>\n\n<p>The X40 also features an extending side brush arm to reach corners — like the Roborock S8 MaxV Ultra — and its dual oscillating mop pads are more effective than Roborock’s thin microfiber pad. If you have a mix of carpeted rooms and hardwood floors with high-pile rugs, the Dreame is the best robot vacuum for you.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25354791/trim.C53A9FD9_159B_4AED_918B_FA75A3CBEC00.gif?quality=90&strip=all&crop=0,3.5850878170139,100,92.829824365972\" title=\"\" />\n<p>Its signature feature is its ability to automatically remove and reattach its mop pads, depending on whether it’s vacuuming or mopping. This solves the problem of how to vacuum and mop without getting your rugs wet. The robot will do this procedure multiple times during cleaning to ensure carpets are vacuumed and floors are mopped. Genius.</p>\n\n<p>While it’s a superb mopper, its vacuuming prowess is slightly behind the Roborock S8 MaxV Ultra because, despite its 12,000Pa suction power, it still only has a single roller rubber brush. The Roborock’s dual rollers are simply better at getting dirt out of carpets and tackling pet hair.</p>\n\n<figure class=\"wp-block-pullquote alignleft\"><blockquote><p>If you have a mix of carpeted rooms and hardwood floors with high-pile rugs, the Dreame is the best robot vacuum for you</p></blockquote></figure>\n\n<p>Roborock’s app is also more stable and easier to use than Dreame’s, which often crashes and can take a while to load. While the Roborock S8 MaxV Ultra is my top pick overall, the Dreame X40 is a very good vacuum, and the two companies are neck and neck regarding innovative features.</p>\n\n<p>The X40 can also clean its washboard, something the Roborock can’t. That area can get quite grungy, so it needs a cleaning every few weeks. The X40 has AI-powered smart dirt detection that uses its cameras to identify spills like milk or particularly dirty areas. When it spots something, it will slow down and do a more thorough cleaning. I also like Dreame’s option to vacuum first and then mop, which the Roborock doesn’t offer.</p>\n\n<p>The X40 has AI-powered obstacle detection, although Roborock’s is just a bit better. However, both still get tripped up occasionally by pencils and other small items — something that never happens with the Roombas with this feature.</p>\n\n<h2 class=\"wp-block-heading\" id=\"cxWX29\">Best midrange robot vacuum / mop </h2>\n\n<p><em><em><strong>Dustbin capacity: </strong>Unknown<strong> </strong>/ <strong>Self-empty dock option: </strong>Yes<strong> </strong>/ <strong>Auto-refill mop option: </strong>Yes<strong> </strong>/<strong> Mop lift: </strong>Yes, 12mm <strong>/</strong> <strong>Mop washing</strong>: Yes, hot air drying <strong>/  Mapping: </strong>Yes, lidar<strong> </strong>/ <strong>AI-powered obstacle detection: </strong>Yes / <strong>Suction power: </strong>8,000Pa / <strong>Remote check-in</strong>: No / <strong>Keep-out zones: </strong>Yes, virtual<strong> </strong>/ <strong>Brush style: </strong>Single rubber / bristle hybrid<strong> </strong>/ <strong>Works with: </strong>Amazon Alexa, Google Home </em></em></p>\n\n<p>The Eufy X10 Pro Omni combines the Eufy Clean X9 Pro mopping robot vacuum and the <a href=\"https://howl.me/clYvySdBoeH\">Eufy X8 Pro</a> self-empty robot vacuum. It’s the first Eufy with a multifunction auto-empty / wash / fill dock, and unlike many bots in this price range, it comes with AI-powered obstacle detection.</p>\n\n<p>With 8,000Pa suction and oscillating dual spinning brushes for mopping, the X10 has all the same functions as the top-of-the-line, all-in-one bots — but it’s not quite as good at any of them. Which is sort of the definition of “midrange.”</p>\n\n<figure class=\"wp-block-pullquote\"><blockquote><p> The X10 has all the same functions as the top-of-the-line, all-in-one bots — but it’s not quite as good at any of them</p></blockquote></figure>\n\n<p>The Eufy performed excellently in my mopping tests, even eradicating dried stains with its 1kg of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some mopping bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. (There’s no hot water washing.)</p>\n\n<p>An edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges. With its square-ish shape, it got into corners better than most of the round bots. But its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25354855/8A0A1070__1_.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<p>The X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.</p>\n\n<p>While its vacuuming is good, particularly on carpet and tile surfaces, the single rubber / bristle roller brush lets it down and is a good illustration of my point that it’s not all about suction power; it’s also about the brushes and how you use them. The Eufy’s brush is supposedly anti-tangle — a cutting tool inside the robot should shred the hair — but this wasn’t effective.</p>\n\n<p>The Eufy Clean app is very easy to use, and the lidar-powered mapping was fast and accurate, dividing my rooms correctly on the first try. There are many customization options — including room-specific cleaning, zone cleaning, and customized cleaning — but the app is clear and well laid out.</p>\n\n<h2 class=\"wp-block-heading\" id=\"T62d06\">Best robot vacuum for pet hair</h2>\n\n<p><em><em><strong>Dustbin capacity: </strong>250 ml<strong> </strong>/ <strong>Self-empty dock option: </strong>Yes<strong> </strong>/ <strong>Auto-refill mop option: </strong>Yes<strong> / Mop lift: </strong>Yes, up and over <strong>/</strong> <strong>Mop washing</strong>: Yes <strong>/ Mapping: </strong>Yes, vSLAM / <strong>AI-powered obstacle detection: </strong>Yes / <strong>Suction power:</strong> N/A <strong>/ Remote check-in:</strong> No<strong> / Keep-out zones: </strong>Yes, virtual / <strong>Brush style: </strong>Dual rubber<strong> </strong>/ <strong>Works with: </strong>Amazon Alexa, Google Home, Siri Shortcuts, Apple Home via the Matter protocol.</em></em></p>\n\n<p>While Roombas may have fallen behind the competition in terms of features and innovation, there’s one area in which they reign supreme, and that’s cleaning prowess. Their dual rubber roller brushes rotate in opposite directions to effectively dig up dirt from carpets, and they are by far the best at tackling pet hair on all surfaces. They are also one of the most self-repairable robot vacuums you can buy, with spare parts for most of the bot’s bits readily available. </p>\n\n<p><span>The newest model, the <a href=\"https://www.amazon.com/iRobot-Roomba-Combo-Vacuum-AutoWash/dp/B0D9ZRH61T\" target=\"_blank\">Combo 10 Max</a>, is the best Roomba for pet hair as it ties for the highest suction power of the current Roomba line</span>, plus it can clean its own mop. It also has top-notch AI-powered obstacle detection that is able to tell the difference between pet poop and a pile of popcorn (and vacuum up one while avoiding the other). </p>\n\n<p>While its mopping isn’t great — the pad is tiny, and there’s no swinging to get along baseboards — it does a decent job, and its <a href=\"https://www.theverge.com/23489768/irobot-roomba-combo-j7-plus-robot-vacuum-mop-review\">retractable mopping system</a> is handy if you have a lot of carpets. All of this makes the Combo 10 Max a great buy for pet parents who are in a daily battle with shedding and occasional muddy paw prints. </p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/8A0A2623.jpeg?quality=90&strip=all&crop=0,10.72910606942,100,78.54178786116\" title=\"\" />\n<p>The Combo is the first Roomba with a multifunction dock that can refill its mopping tank and self-wash its mopping pad, meaning less hands-on time for you. (The <a href=\"https://www.irobot.com/en_US/roomba-combo-j9plus-auto-fill-robot-vacuum-and-mop/C975020.html\">j9 Combo Plus</a> has the same suction power and can refill its mopping tank but can’t wash the mop pad.) The SmartScrub feature that tells the robot to wiggle its butt to scrub your floors works surprisingly well, but it’s really only effective on small areas, making it good to run in hallways and around pet bowls for an extra clean. </p>\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>The Dirt Detect feature remembers the dirtiest rooms, actively seeking out spots my hairy Wirehaired Pointing Griffon hangs out</p></blockquote></figure>\n\n<p>The Dirt Detect feature remembers the dirtiest rooms, and I found that meant it actively seeks out the spots my hairy Wirehaired Pointing Griffon hangs out. The 10 Max can also be set to mop only, which is a new option and is handy for deep cleans. But there’s no hot water washing or hot air drying of the mop as there is on similar Dreame and Roborock models, so you’ll want to throw the pad in the washing machine every now and then. </p>\n\n<p>iRobot’s app is also a bit of a pain point. While I appreciate its simplicity, I miss the deeper cleaning customization options that most other high-end robot vacuum apps offer. And it’s recently started popping up ads for Roomba products when I navigate between screens — which is one of the features I did not want to see migrate over from the competition.</p>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/8A0A2036.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<p>While its mapping is very good, it can take a really long time (Roombas use <a href=\"https://www.automate.org/vision/blogs/what-is-visual-slam-technology-and-what-is-it-used-for\">vSLAM</a>, not lidar), and it doesn’t seem to adapt to changes in my home as easily as other robots. (It also doesn’t lose my maps as often as other robots.) I’ve also noticed that the newer Roombas (j9 and 10 Max) suffer from the occasional navigation glitches, occasionally getting confused and needing to be rebooted.</p>\n\n<p>I really like Roomba’s dock design, which, while large enough to accommodate two rather small water tanks, is the most stylish of all the multifunction docks. Plus, because you access the water tanks from the front rather than the top (as on most other models), it can be used as a table. That’s a small quality-of-life upgrade I enjoy. </p>\n\n<p>Overall, it’s a good-looking robot that vacuums really well and is smart enough to get the job done with limited intervention. If you’re not interested in mopping at all, however, save some money and get the <a href=\"https://www.amazon.com/iRobot-Roomba-Self-Emptying-Robot-Vacuum/dp/B0C415NHBM\">Roomba j9 Plus</a>. It has similar cleaning prowess, a self-empty dock, and no messing with mopping.</p>\n\n<h2 class=\"wp-block-heading\" id=\"tC6uGA\">Other robot vacuums to consider</h2>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25332758/8A0A1005.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<ul class=\"wp-block-list\">\n<li>The <a href=\"https://www.theverge.com/24098771/dyson-vis-nav-robot-vacuum-hands-on\">360 Vis Nav</a> (<a href=\"https://www.dyson.com/vacuum-cleaners/robot/360-vis-nav/blue-nickel\">$999.99</a>), Dyson’s first robovac in the US in almost a decade, is a powerful beast and the best robot vacuum for carpets I’ve tested. But its navigation needs a lot of work. If you have a simple floor plan with a lot of carpets, it is worth considering, but the short battery life and lack of an auto-empty dock are major cons. Read more <a href=\"https://www.theverge.com/24098771/dyson-vis-nav-robot-vacuum-hands-on\">in this hands-on</a>.</li>\n\n\n\n<li>The Roomba j7 ($599.99) is a <a href=\"https://www.theverge.com/22880352/irobot-roomba-j7-plus-samsung-jet-bot-ai-plus-robot-vacuum-review-comparison-test\">previous top pick</a> that has great AI-powered obstacle detection, excellent navigation skills, and superior cleaning power. It can be a bit rough with furniture, but it is aggressive at getting your floors clean and is a great vacuum-only Roomba.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/24141479/roborock-s8-maxv-ultra-vs-dreame-x30-ultra-robot-vacuum-mop\">Dreame X30 Ultra</a> (<a href=\"https://www.dreametech.com/products/dreame-x30-ultra/\">$699.99</a> <s>$1,399.99</s>) is the older version of my top pick for a vacuum / mop hybrid and is a great buy if you can get it on sale. It does most everything the X40 Ultra does, just with lower suction power (8,3000Pa) and no flexi-arm.</li>\n\n\n\n<li>The Roborock Q8 Max Plus (<a href=\"https://www.amazon.com/roborock-Q8-Max-Navigation-Multi-Level/dp/B0C7VBXHS8\">$259.99</a> <s>$599.99</s>) is the bigger brother to the Q5 Pro (my pick for pet hair in my <a href=\"https://www.theverge.com/23846479/best-budget-robot-vacuum-robot-mop\">budget robot vacuum guide</a>), adding better obstacle detection (still no camera) and better mopping. However, it has a smaller bin to make way for a much bigger water reservoir for mopping (350ml). If you like the idea of the Q5 Pro but want better mopping, this is a good option.</li>\n\n\n\n<li>The Roborock S8 Plus (<a href=\"https://www.amazon.com/roborock-S8-Self-Empty-Ultrasonic-Detection/dp/B0BVB45FHV?th=1\">$759.99</a> <s>$999.99</s>) is a great vacuum that can mop well, has good obstacle detection, and has a sleeker, smaller charging / auto-empty dock with no water tank. Its dual rubber roller brushes and 6,000Pa of suction do a good job, and its flat mop that vibrates is effective at scrubbing your floors.</li>\n\n\n\n<li><span>The <a href=\"https://www.theverge.com/2023/1/4/23531209/roborock-s8-pro-robot-vacuums-price-specs-release-date-ces\" target=\"_blank\">Roborock S8 Pro Ultra</a> (<a href=\"https://www.amazon.com/Pro-Ultra-Self-Washing-Self-Refilling-Self-Emptying/dp/B0BVB5PTDK/\">$1,399.99</a> <s>$1,599.99</s>) is similar to the S8 MaxV but ditches the camera, </span>so it’s less effective at dodging obstacles than the S8 MaxV. Get this <span>if you don’t want a camera on your robot and don’t mind not having Matter support or </span>a built-in voice assistant.</li>\n\n\n\n<li>The Shark Matrix Plus 2-in-1 (<a href=\"https://www.bestbuy.com/site/shark-matrix-plus-2-in-1-robot-vacuum-mop-with-sonic-mopping-matrix-clean-home-mapping-hepa-bagless-self-empty-wifi-black/6514530.p\">$379.99</a> <s>$699.99</s>) was my previous runner-up pick for a midrange option that self-empties its bin, vacuums, and mops. It mops very well, but you have to manually fill and attach the mop reservoir and empty the bin.</li>\n</ul>\n\n<h2 class=\"wp-block-heading\" id=\"wJlydD\">What I’m testing and what’s coming next</h2>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/8A0A2487.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<ul class=\"wp-block-list\">\n<li>Roborock’s Saros 10 ($<a href=\"https://us.roborock.com/products/roborock-saros-10\">1,599.99</a>) and 10R ($<a href=\"https://us.roborock.com/products/roborock-saros-10r\">1,599.99</a>) are upgrades to the <a href=\"https://www.theverge.com/24141479/roborock-s8-maxv-ultra-vs-dreame-x30-ultra-robot-vacuum-mop\">S8 MaxV Ultra</a>. Both can automatically remove their mop pads when not needed — a new option for Roborock — and feature an <a href=\"https://www.theverge.com/2024/9/5/24236509/roborock-qrevo-curv-can-lift-itself-up\">AdaptLift chassis</a> to climb high room transitions. The 10R features 19,000Pa suction power, StarSight 2.0 navigation, and oscillating mops. The Saros 10 has 22,000Pa of suction power, lidar navigation, and the vibrating flat mopping pad of the S8 MaxV.</li>\n\n\n\n<li>Roborock also <a href=\"https://www.theverge.com/news/632881/roborock-saros-z70-robot-vacuum-pre-orders-price\">recently released</a> the $1,899 <a href=\"https://us.roborock.com/products/roborock-saros-z70/\">Saros Z70</a>, the first mass-produced robovac to feature a robotic arm that can pick up objects like socks and tissues. It also boasts 22,000Pa suction power, supports Roborock’s <a href=\"https://go.skimresources.com/?id=1025X1701640&xs=1&url=https%3A%2F%2Fus.roborock.com%2Fpages%2Froborock-starsight-autonomous-system%3Fsrsltid%3DAfmBOopeLu1UJ3C2aY8wzR7uzz9zTGnfDh4DDxspZh922Yl_3HVuLLKp%26irclickid%3D2mNTTf0XCxyNUwfyCLUQjRO9Uks3w%253A3NyQbrzM0%26irgwc%3D1%26utm_medium%3Daffiliate%26utm_source%3Dimpact%26utm_campaign%3Dstore_im%26utm_content%3DOnline%2520Tracking%2520Link_1179705%26partner%3DSkimbit%2520Ltd.%26group%3D%26mpid%3D10078&xcust=__vg0404awD__632881__________________google.com\" rel=\"noreferrer noopener\" target=\"_blank\">StarSight navigation system</a>, and features an AdaptLift chassis.</li>\n\n\n\n<li>In March, iRobot <a href=\"https://www.theverge.com/news/627751/irobot-launches-eight-new-roombas-with-lidar-room-mapping\">announced</a> a new Roomba lineup that starts at $299 and goes up to $999, and is currently available to pre-order. All of the robovacs come with lidar navigation and mapping, 7,000Pa suction power, and four suction levels. The pricier 405 and 505 models are the first Roombas to feature dual spinning mopping pads, while the 505 also offers heated mop drying, which is something even <a href=\"https://www.theverge.com/2024/7/23/24203847/irobot-new-roomba-combo-10-max-robot-vacuum-matter-support\">the higher-end Combo 10 Max</a> lacks. </li>\n\n\n\n<li>iRobot also <a href=\"https://www.theverge.com/news/654732/irobot-roomba-max-705-robot-vacuum-launches\">recently announced</a> the <a href=\"https://www.anrdoezrs.net/links/8836598/type/dlg/sid/__vg0505awD__654732__________________google.com/https://www.irobot.com/en_US/roomba-max-705-vac-robot-plus-autoempty-dock/W155020.html\" rel=\"noreferrer noopener\" target=\"_blank\">Roomba Max 705</a>, which costs $899.99 and comes with an auto-empty dock. The Matter-compatible robovac brings back iRobot’s dual rubber roller brushes, which, based on our previous testing, do an excellent job of picking up pet hair; the 705 also features AI-powered obstacle detection, lidar navigation, and 13,000Pa of suction — the most of any Roomba to date.</li>\n\n\n\n<li>The recently announced <a href=\"https://www.eufy.com/products/t2352111?variant=44777786867898\">Eufy Robot Vacuum Omni E28</a> is a self-emptying, self-refilling, and self-washing robot vacuum / mop hybrid. The $999.99 vac comes with a deep cleaner integrated into the charging dock, which you can use to spray clean water on stains before sucking everything into a separate wastewater tank. It’s also powerful, boasting up to 20,000Pa of suction power, and offers AI-powered obstacle detection and Matter support. </li>\n\n\n\n<li>The Dreame X50 Ultra ($<a href=\"https://www.dreametech.com/products/x50-ultra-robot-vacuum\">1,699.99</a>) adds a “motorized swing arm” <a href=\"https://www.theverge.com/2025/1/6/24337114/dreame-x50-ultra-robot-vacuum-climb-steps-legs-price-ces\">that acts like a leg</a>, allowing the robovac to climb a transition up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra, only with higher suction power.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/2025/1/6/24332354/ecovacs-deebot-x8-pro-omni-robovac-roller-mop-ces\" rel=\"noreferrer noopener\" target=\"_blank\">Ecovacs Deebot X8 Pro Omni</a> ($<a href=\"https://www.amazon.com/dp/B0DR8NJMCJ/\">1,299.99</a>) is the first Deebot with a roller mop. The mop is also extendable and self-cleaning and pairs with 18,000Pa of suction power and a redesigned auto-empty fill dock.</li>\n\n\n\n<li><span>The <a href=\"https://www.amazon.com/SwitchBot-TwinFlowTM-Collection-Lightweight-Compatible/dp/B0DFLZGWKY?tag=theverge02-20\" target=\"_blank\">Switchbot K10 Plus Pro Combo</a> ($799.99) is an upgrade to the c</span>ompact K10 Plus, a previous pick for the best robot vacuum for small spaces. It has better obstacle detection and a bump up to 3,000Pa of suction power. Plus, its auto-empty dock incorporates a manual stick vacuum.</li>\n\n\n\n<li>The <a href=\"https://www.theverge.com/2025/1/5/24333438/switchbot-multitasking-household-robot-k20-plus-pro-price-specs-release-date#:~:text=The%20S20%20mopping%20robot%20vacuum%20gets%20some%20upgrades%20that%20matter\" rel=\"noreferrer noopener\" target=\"_blank\">Switchbot S20 Pro</a> robot vacuum / mop hybrid, the successor to my previous pick for favorite mopping vacuum, <a href=\"https://www.theverge.com/24144618/switchbot-s10-review-robot-vacuum\">the S10</a>, is scheduled to launch in May or June. It features an extendable roller mop and side brush and 15,000Pa of suction power, more than twice that of the prior model.</li>\n\n\n\n<li>SharkNinja’s <a href=\"https://www.theverge.com/2024/9/5/24236248/sharkninja-nevertouch-pro-robot-vacuum-mop-stick\">PowerDetect NeverTouch Pro 2-in-1</a> robot vacuum / mop ($<a href=\"https://www.sharkclean.com/zidRV2820ZE\">999.99</a>) can lift itself over rugs by up to 20mm. Uniquely, its automatic empty /wash / dry cleaning station doesn’t require bags.</li>\n\n\n\n<li>Roborock’s <a href=\"https://www.theverge.com/2024/9/5/24236509/roborock-qrevo-curv-can-lift-itself-up\">Qrevo Curv</a> (<a href=\"https://us.roborock.com/products/roborock-qrevo-curv\">$1,599.99</a>) can raise itself to clear thresholds up to 40mm. The svelte-looking bot gets its name from a curved FlexiArm Arc side brush, which helps prevent hair from tangling as much.</li>\n\n\n\n<li><span>Narwal’s <a href=\"https://www.theverge.com/2024/9/6/24237324/this-robot-vacuum-has-two-eyes-to-see-your-floors-better\" target=\"_blank\">Freo Z Ultra</a> (<a href=\"https://us.narwal.com/products/narwal-freo-z-ultra-early-bird-offer\">$1,499.99</a>) is an upgrade to my current pick for a best mopping bot</span>. It features dual cameras and dual AI chips for seeing and identifying objects, which should help with obstacle detection and vacuuming methods.</li>\n\n\n\n<li>The <a href=\"https://howl.me/cmyEPsnq33A\">Eufy S1 Pro ($1,499)</a> has a long roller mop that self-cleans as it mops and features a square-ish design that allows it to get into corners more easily. A single rubber roller brush, 8,000Pa of suction, and 3D-powered obstacle detection tackle the vacuuming.</li>\n\n\n\n<li><a href=\"https://maticrobots.com/product\">The Matic is a $1,095 robot vacuum</a> that doesn’t need a cloud connection and uses cameras to navigate and is the first robovac mop I’ve seen that can suck up wet spills as well as dry. <a href=\"https://www.theverge.com/2024/1/9/24031329/i-watched-the-matic-robo-vac-suck-up-a-glass-of-milk\">Here’s some video of it in action</a>.</li>\n</ul>\n\n<h2 class=\"wp-block-heading\" id=\"UZYu04\">How I test robot vacuums</h2>\n<img alt=\"\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25102805/8A0A0574.jpeg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613\" title=\"\" />\n<p>I test robot vacuums constantly. At any time, there are seven or eight of these busy little bots roaming my floors. Alongside everyday use, I put them through a gauntlet of specific tests. This includes testing object detection and avoidance with phone chargers, socks, a pencil, and fake pet poop. I throw in Cheerios or popcorn to see if they know to vacuum that up rather than avoid it. I also run them over oatmeal and flour to see how well they pick up fine debris and have them tackle both thick and low-pile carpets. I watch to see how they handle rug tassels, skinny chair legs, and room transitions.</p>\n\n<p>For mopping prowess, I test them on hardwood and tile floors with dried milk, fresh OJ, and ketchup. I monitor how quickly they fill up their bin / auto-empty dock and how efficiently they use water and clean their mop pads. </p>\n\n<p>I also set schedules, hook them up to voice assistants, and play with any advanced features in the app. I evaluate how well they map and how easy the maps are to edit and use, as well as test and unique features such as home security camera capabilities, AI cleaning programs, and auto-mop removal.</p>\n\n<div class=\"wp-block-vox-media-methodology-accordion\"><div class=\"wp-block-vox-media-methodology-accordion\">\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Does suction power matter in robot vacuums?</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">Suction power is <a href=\"https://www.britannica.com/science/pascal-unit-of-energy-measurement\">measured in pascals (Pa)</a>, and while most vacuums offer between 5,000 and 8,000, we’re starting to see robots with 18,000 and even 22,000Pa. Higher suction power will do a better job getting the fine dust and debris off your floor, but it’s important that it’s paired with effective brushes. The real key to a clean floor with a robot vac is consistency. Run it daily if you can; it won’t keep up as well if it only runs once a week. If you want hands-free cleaning everywhere, you’ll want to budget for one per floor or be prepared to move it around. You can also buy extra charging bases, and most models can map multiple floors.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Do all robot vacuums work with voice control?</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\">Yes, every Wi-Fi-connected robot vacuum worth its salt today works with Alexa or Google smart speakers for voice control. However, some are limited to stop, start, pause, and maybe suction level, whereas others can be told to go clean specific areas. Here’s how to set up a bot with <a href=\"https://www.theverge.com/22961597/robot-vacuum-connect-control-amazon-alexa-assistant-roomba-roborock-how-to\">Alexa voice control</a> or <a href=\"https://www.theverge.com/22968709/robot-vacuum-connect-google-assistant-roomba-roborock-how-to\">Google Home voice control</a>. A couple of manufacturers now also work with <a href=\"https://www.theverge.com/2022/3/17/22982578/irobot-software-update-roomba-robot-vacuums\">Siri Shortcuts, so you can use Apple’s Siri voice assistant to command your bot</a>. Robot vacuums are <a href=\"https://www.theverge.com/2023/10/23/23925489/matter-1-2-smart-home-support-new-devices\">now part of Matter</a>, meaning more opportunities for smart home integration and native Siri voice control for robot vacuums.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-vox-media-methodology-accordion-item\"><div class=\"wp-block-vox-media-methodology-accordion-item\">\n<p class=\"has-text-align-none c-methodology-accordion__item-heading\">Which robot vacuums will work with Matter?</p>\n\n\n\n<p class=\"has-text-align-none c-methodology-accordion__item-content\"><a href=\"https://www.theverge.com/23568091/matter-compatible-devices-accessories-apple-amazon-google-samsung\">Matter</a> is a new smart home standard that allows connected gadgets to work with any smart home platform, including Apple Home, Amazon Alexa, Google Home, and Samsung SmartThings. When connected to your smart home platform through Matter, you should be able to control basic robot actions including start / stop and changing cleaning modes, as well as get alerts directly in the app, meaning you won’t need to use the manufacturer’s app for these functions.<br /><br />The latest Matter spec, <a href=\"https://www.theverge.com/2024/11/7/24289972/matter-smart-home-standard-1-4-spec-new-features-device-types\">Matter 1.4</a>, adds support for cleaning specific areas, so while you will still need the manufacturer app to set up a map, you will be able to use your smart home platform app and / or voice assistant to direct the robot to do things like clean the kitchen or clean downstairs. Samsung SmartThings and Amazon both support robot vacuums in Matter; Apple has added it <a href=\"https://www.theverge.com/news/618024/ios-18-4-developer-beta-matter-robot-vacuum-support-apple-home\">to iOS 18.4</a>, which should come this spring, and Google said support is coming soon.<br /><br />While Amazon Alexa and Google Home have supported robot vacuums for years via the cloud, Matter will bring this control locally. It will also bring support to Apple Home for the first time, allowing you to control them with Siri through HomePods and add them to scenes and automation.<br /><br />There are still relatively few robot vacuums that support Matter. As of May 2025, that list includes:<br /><a href=\"https://www.theverge.com/2025/1/6/24332354/ecovacs-deebot-x8-pro-omni-robovac-roller-mop-ces\">Ecovacs X8 Pro Omni</a><br /><a href=\"https://www.theverge.com/2024/1/8/24024516/ecovacs-deebot-x2-combo-cleaning-station-handheld-vacuum\">Ecovacs Deebot X2 Combo</a><br /><a href=\"https://www.theverge.com/2025/1/5/24333438/switchbot-multitasking-household-robot-k20-plus-pro-price-specs-release-date#:~:text=The%20S20%20mopping%20robot%20vacuum%20gets%20some%20upgrades%20that%20matter\">SwitchBot S20</a><br /><a href=\"https://www.theverge.com/24144618/switchbot-s10-review-robot-vacuum\">SwitchBot S10</a><br /><a href=\"https://www.theverge.com/news/611748/switchbot-k10-plus-pro-combo-robot-vacuum-hands-on\">SwitchBot K10 Pro Plus</a><br /><a href=\"https://www.theverge.com/2023/11/10/23954700/the-first-robot-vacuum-to-promise-matter-support-arrives\">SwitchBot K10 Plus</a><br /><a href=\"https://www.theverge.com/2025/1/6/24337114/dreame-x50-ultra-robot-vacuum-climb-steps-legs-price-ces\">Dreame X50 Ultra</a><br />Dreame X40 Ultra<br /><a href=\"https://www.theverge.com/2025/1/5/24332998/roborock-saros-z70-robot-vacuum-omnigrip-arm\">Roborock Saros 10 and 10R</a><br /><a href=\"https://www.theverge.com/24141479/roborock-s8-maxv-ultra-vs-dreame-x30-ultra-robot-vacuum-mop\">Roborock S8 MaxV Ultra</a><br /><a href=\"https://www.theverge.com/2024/7/23/24203847/irobot-new-roomba-combo-10-max-robot-vacuum-matter-support\">Roomba Combo 10</a></p>\n</div></div>\n</div></div>\n\n<p><em>Photos by Jennifer Pattison Tuohy / The Verge</em></p>\n\n<p><em><strong>Update, May 5th: </strong>Adjusted pricing / availability and mentioned a couple of new models, specifically the Roomba Max 705 and Eufy Robot Vacuum Omni E28</em>.<em> Sheena Vasani also contributed to this post.</em></p>\n\n<p class=\"has-text-align-none\"></p>",
    "source_feed": "https://www.theverge.com/rss/index.xml",
    "scraped_at_iso": "2025-05-05T22:51:01Z",
    "selected_image_url": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/257605_best_budget_robot_vacuums_CVirginia.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "filter_verdict": {
        "importance_level": "Interesting",
        "topic": "Other",
        "reasoning_summary": "Promoted from Boring due to mention of 'google'. Original reason: The article is a general overview of robot vacuums without any new, verifiable information or significant developments.",
        "primary_topic_keyword": "robot vacuums overview"
    },
    "filter_error": null,
    "filtered_at_iso": "2025-05-05T22:58:02Z",
    "topic": "Other",
    "is_breaking": false,
    "primary_keyword": "robot vacuums overview",
    "seo_agent_results": {
        "generated_title_tag": "The Best Robot Vacuums Overview for 2025",
        "generated_meta_description": "Discover the top robot vacuums in 2025, featuring advanced cleaning, mopping, and AI navigation. Get the best robot vacuums overview here.",
        "generated_json_ld": "<script type=\"application/ld+json\">  \n{  \n  \"@context\": \"https://schema.org\",  \n  \"@type\": \"NewsArticle\",  \n  \"headline\": \"The Best Robot Vacuums Overview for 2025\",  \n  \"description\": \"Discover the top robot vacuums in 2025, featuring advanced cleaning, mopping, and AI navigation. Get the best robot vacuums overview here.\",  \n  \"keywords\": [\"robot vacuums overview\"],  \n  \"mainEntityOfPage\": { \"@type\": \"WebPage\", \"@id\": \"https://www.theverge.com/22997597/best-robot-vacuum-cleaner\" },  \n  \"image\": { \"@type\": \"ImageObject\", \"url\": \"https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/257605_best_budget_robot_vacuums_CVirginia.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200\" },  \n  \"datePublished\": \"2025-05-05T22:16:04Z\",  \n  \"author\": { \"@type\": \"Person\", \"name\": \"AI News Team\" },  \n  \"publisher\": {  \n    \"@type\": \"Organization\",  \n    \"name\": \"Dacoola\",  \n    \"logo\": { \"@type\": \"ImageObject\", \"url\": \"https://dacoolaa.netlify.app\" }  \n  }  \n}  \n</script>",
        "generated_article_body_md": "## The Best Robot Vacuums  \n\nRobot vacuums have evolved from simple floor sweepers to advanced home robots capable of vacuuming, mopping, and even self-cleaning. With improved batteries, AI-powered navigation, and obstacle detection, modern models require minimal human intervention. The latest options cater to diverse needs, from pet hair removal to deep mopping, making them indispensable for busy households.  \n\n### Why It Matters  \n\nThe advancements in robot vacuums highlight a shift toward smarter, more autonomous home maintenance. These devices save time and effort while adapting to various floor types and household layouts. As AI and mapping technologies improve, robot vacuums are becoming more efficient, reducing the need for manual cleaning. This trend reflects broader smart home innovations, emphasizing convenience and efficiency in daily life."
    },
    "seo_agent_error": null,
    "generated_tags": [
        "Robot Vacuums",
        "Smart Home Devices",
        "AI-Powered Navigation",
        "Home Maintenance",
        "Pet Hair Removal",
        "Self-Cleaning Robots",
        "Smart Home Innovations",
        "Autonomous Cleaning",
        "Robot Vacuum Technology",
        "Household Cleaning"
    ],
    "tags_agent_error": null,
    "trend_score": 15.0,
    "slug": "the-best-robot-vacuums",
    "audio_url": null,
    "post_template_hash": "c3831ae59bdf615c6cf491b278dcca53d254b448a7420510b50d004bb9072292"
}