{
    "id": "c942fb7066023a0c46d613f5c513f2c2f40fb0764eba0f12eacde6c0d087b115",
    "title": "WordFinder app: Harnessing generative AI on AWS for aphasia communication",
    "link": "https://aws.amazon.com/blogs/machine-learning/wordfinder-app-harnessing-generative-ai-on-aws-for-aphasia-communication/",
    "published_iso": "2025-05-02T16:16:16Z",
    "summary": "<p>In this post, we showcase how Dr. Kori Ramajoo, Dr. Sonia Brownsett, Prof. David Copland, from QARC, and Scott Harding, a person living with aphasia, used AWS services to develop WordFinder, a mobile, cloud-based solution that helps individuals with aphasia increase their independence through the use of AWS generative AI technology.</p> \n<p>In the spirit of giving back to the community and harnessing the art of the possible for positive change, AWS hosted the Hack For Purpose event in 2023. This hackathon brought together teams from AWS customers across Queensland, Australia, to tackle pressing challenges faced by social good organizations.<br /><br />The University of Queensland’s <a href=\"https://shrs.uq.edu.au/qarc\" rel=\"noopener\" target=\"_blank\">Queensland Aphasia Research Centre (QARC)</a>’s mission is to improve access to technology for people living with aphasia, a communication disability that can impact an individual’s ability to express and understand spoken and written language.</p> \n<h2>The challenge: Overcoming communication barriers</h2> \n<p>In 2023, it was estimated that more than 140,000 people in Australia were living with aphasia. This number is expected to grow to over 300,000 by 2050. Aphasia can make everyday tasks like online banking, using social media, and trying new devices challenging. The goal was to create a mobile app that could assist people with aphasia by generating a word list of the objects that are in a user-selected image and extend the list with related words, enabling them to explore alternative communication methods.</p> \n<h2>Overview of the solution</h2> \n<p>The following screenshot shows an example of navigating the WordFinder app, including sign in, image selection, object definition, and related words.<br /><img alt=\"\" class=\"alignnone size-medium wp-image-102281\" height=\"300\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/03/22/1-Sign-in-151x300.png\" width=\"151\" /> <img alt=\"\" class=\"alignnone size-medium wp-image-102282\" height=\"300\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/03/22/2-Image-Selection-151x300.png\" width=\"151\" /> <img alt=\"\" class=\"alignnone size-medium wp-image-102283\" height=\"300\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/03/22/3-Photo-Access-148x300.png\" width=\"148\" /> <img alt=\"\" class=\"alignnone size-medium wp-image-102284\" height=\"300\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/03/22/4-Image-chosen-151x300.png\" width=\"151\" /> <img alt=\"\" class=\"alignnone size-medium wp-image-102285\" height=\"300\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/03/22/5-Related-words-151x300.png\" width=\"151\" /><br /><br />In the preceding diagram, the following scenario unfolds:&nbsp;</p> \n<ol> \n <li><strong>Sign in</strong>: The first screen shows a simple sign-in page where users enter their email and password. It includes options to create an account or recover a forgotten password.</li> \n <li><strong>Image selection</strong>: After signing in, users are prompted to <strong>Pick an image to search</strong>. This screen is initially blank.</li> \n <li><strong>Photo access</strong>: The next screen shows a popup requesting private access to the user’s photos, with a grid of sample images visible in the background.</li> \n <li><strong>Image chosen</strong>: After an image is selected (in this case, a picture of a koala), the app displays the image along with some initial tags or classifications such as <strong>Animal</strong>, <strong>Bear</strong>, <strong>Mammal</strong>, <strong>Wildlife</strong>, and <strong>Koala</strong>.</li> \n <li><strong>Related words</strong>: The final screen shows a list of related words based on the selection of <strong>Related Words</strong> next to <strong>Koala</strong> from the previous screen. This step is crucial for people with aphasia who often have difficulties with word-finding and verbal expression. By exploring related words (such as habitat terms like tree and eucalyptus, or descriptive words like fur and marsupial), users can bridge communication gaps when the exact word they want isn’t immediately accessible. This semantic network approach aligns with common aphasia therapy techniques, helping users find alternative ways to express their thoughts when specific words are difficult to recall.</li> \n</ol> \n<p>This flow demonstrates how users can use the app to search for words and concepts by starting with an image, then drilling down into related terminology—a visual approach to expanding vocabulary or finding associated words.<br /><br />The following diagram illustrates the solution architecture on AWS.</p> \n<p><img alt=\"\" class=\"alignnone size-full wp-image-102287\" height=\"405\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/03/22/WordFinder-app-Architecture.png\" width=\"720\" /></p> \n<p>In the following sections, we discuss the flow and key components of the solution in more detail.</p> \n<ol> \n <li><strong>Secure access using Route 53 and Amplify</strong>&nbsp; \n  <ol> \n   <li>The journey begins with the user accessing the WordFinder app through a domain managed by <a href=\"https://aws.amazon.com/route53\" rel=\"noopener\" target=\"_blank\">Amazon Route 53</a>, a highly available and scalable cloud DNS web service. <a href=\"https://aws.amazon.com/amplify\" rel=\"noopener\" target=\"_blank\">AWS Amplify</a> hosts the <a href=\"https://reactnative.dev/\" rel=\"noopener\" target=\"_blank\">React Native</a> frontend, providing a seamless cross-environment experience.&nbsp;</li> \n  </ol> </li> \n <li><strong>Secure authentication with Amazon Cognito</strong>&nbsp; \n  <ol> \n   <li>Before accessing the core features, the user must securely authenticate through <a href=\"https://aws.amazon.com/cognito\" rel=\"noopener\" target=\"_blank\">Amazon Cognito</a>. Cognito provides robust user identity management and access control, making sure that only authenticated users can interact with the app’s services and resources.&nbsp;</li> \n  </ol> </li> \n <li><strong>Image capture and storage with Amplify and Amazon S3</strong>&nbsp; \n  <ol> \n   <li>After being authenticated, the user can capture an image of a scene, item, or scenario they wish to recall words from. AWS Amplify streamlines the process by automatically storing the captured image in an <a href=\"https://aws.amazon.com/s3\" rel=\"noopener\" target=\"_blank\">Amazon Simple Storage Service (Amazon S3)</a> bucket, a highly available, cost-effective, and scalable object storage service.&nbsp;</li> \n  </ol> </li> \n <li><strong>Object recognition with Amazon Rekognition</strong>&nbsp; \n  <ol> \n   <li>As soon as the image is stored in the S3 bucket, <a href=\"https://aws.amazon.com/rekognition\" rel=\"noopener\" target=\"_blank\">Amazon Rekognition</a>, a powerful computer vision and machine learning service, is triggered. Amazon Rekognition analyzes the image, identifying objects present and returning labels with confidence scores. These labels form the initial word prompt list within the WordFinder app, kickstarting the word-finding journey.&nbsp;</li> \n  </ol> </li> \n <li><strong>Semantic word associations with API Gateway and Lambda</strong>&nbsp; \n  <ol> \n   <li>While the initial word list generated by Amazon Rekognition provides a solid starting point, the user might be seeking a more specific or related word. To address this challenge, the WordFinder app sends the initial word list to an <a href=\"https://aws.amazon.com/lambda\" rel=\"noopener\" target=\"_blank\">AWS Lambda</a> function through <a href=\"https://aws.amazon.com/api-gateway/\" rel=\"noopener\" target=\"_blank\">Amazon API Gateway</a>, a fully managed service that securely handles API requests.&nbsp;</li> \n  </ol> </li> \n <li><strong>Lambda with Amazon Bedrock, and generative AI and prompt engineering using Amazon Bedrock</strong> \n  <ol> \n   <li>The Lambda function, acting as an intermediary, crafts a carefully designed prompt and submits it to <a href=\"https://aws.amazon.com/bedrock\" rel=\"noopener\" target=\"_blank\">Amazon Bedrock</a>, a fully managed service that offers access to high-performing foundation models (FMs) from leading AI companies, including Anthropic’s Claude model.</li> \n   <li>Amazon Bedrock generative AI capabilities, powered by Anthropic’s Claude model, use advanced language understanding and generation to produce semantically related words and concepts based on the initial word list. This process is driven by prompt engineering, where carefully crafted prompts guide the generative AI model to provide relevant and contextually appropriate word associations.</li> \n  </ol> </li> \n</ol> \n<h2>WordFinder app component details</h2> \n<p>In this section, we take a closer look at the components of the WordFinder app.</p> \n<h3>React Native and Expo</h3> \n<p>WordFinder was built using <a href=\"https://reactnative.dev/\" rel=\"noopener\" target=\"_blank\">React Native</a>, a popular framework for building cross-environment mobile apps. To streamline the development process, <a href=\"https://expo.dev/\" rel=\"noopener\" target=\"_blank\">Expo</a> was used, which allows for write-once, run-anywhere capabilities across Android and iOS operating systems.</p> \n<h3>Amplify</h3> \n<p>Amplify played a crucial role in accelerating the app’s development and provisioning the necessary backend infrastructure. Amplify is a set of tools and services that enable developers to build and deploy secure, scalable, and full stack apps. In this architecture, the frontend of the word finding app is hosted on Amplify. The solution uses several Amplify components:</p> \n<ul> \n <li><strong>Authentication and access control</strong>: Amazon Cognito is used for user authentication, enabling users to sign up and sign in to the app. Amazon Cognito provides user identity management and access control with access to an Amazon S3 bucket and an API gateway requiring authenticated user sessions.</li> \n <li><strong>Storage</strong>: Amplify was used to create and deploy an S3 bucket for storage. A key component of this app is the ability for a user to take a picture of a scene, item, or scenario that they’re seeking to recall words from. The solution needs to temporarily store this image for processing and analysis. When a user uploads an image, it’s stored in an S3 bucket for processing with Amazon Rekognition. Amazon S3 provides highly available, cost-effective, and scalable object storage.</li> \n <li><strong>Image recognition</strong>: Amazon Rekognition uses computer vision and machine learning to identify objects present in the image and return labels with confidence scores. These labels are used as the initial word prompt list within the WordFinder app.</li> \n</ul> \n<h3>Related words</h3> \n<p>The generated initial word list is the first step toward finding the desired word, but the labels returned by Amazon Rekognition might not be the exact word that someone is looking for. The project team then considered how to implement a thesaurus-style lookup capability. Although the project team initially explored different programming libraries, they found this approach to be somewhat rigid and limited, often returning only synonyms and not entities that are related to the source word. The libraries also added overhead associated with packaging and maintaining the library and dataset moving forward.<br /><br />To address these challenges and improve responses for related entities, the project team turned to the capabilities of generative AI. By using the generative AI foundation models (FMs), the project team was able to offload the ongoing overhead of managing this solution while increasing the flexibility and curation of related words and entities that are returned to users. The project team integrated this capability using the following services:</p> \n<ul> \n <li><strong>Amazon Bedrock</strong>: Amazon Bedrock is a fully managed service that offers a choice of high-performing FMs from leading AI companies like AI21 Labs, Anthropic, Cohere, Meta, Mistral AI, Stability AI, and Amazon through a single API, along with a broad set of capabilities to build generative AI apps with security, privacy, and responsible AI. The project team was able to quickly integrate with, test, and evaluate different FMs, finally settling upon Anthropic’s Claude model.</li> \n <li><strong>API Gateway</strong>: The project team extended the Amplify project and deployed API Gateway to accept secure, encrypted, and authenticated requests from the WordFinder mobile app and pass them to a Lambda function handling Amazon Bedrock access.&nbsp;</li> \n <li><strong>Lambda</strong>: A Lambda function was deployed behind the API gateway to handle incoming web requests from the mobile app. This function was responsible for taking the supplied input, building the prompt, and submitting it to Amazon Bedrock. This meant that integration and prompt logic could be encapsulated in a single Lambda function.</li> \n</ul> \n<h3>Benefits of API Gateway and Lambda</h3> \n<p>The project team briefly considered using the AWS SDK for JavaScript v3 and credentials sourced from Amazon Cognito to directly interface with Amazon Bedrock. Although this would work, there were several benefits associated with implementing API Gateway and a Lambda function:</p> \n<ul> \n <li><strong>Security</strong>: To enable the mobile client to integrate directly with Amazon Bedrock, authenticated users and their associated AWS Identity and Access Management (IAM) role would need to be granted permissions to invoke the FMs in Amazon Bedrock. This could be achieved using Amazon Cognito and short-term permissions granted through roles. Consideration was given to the potential of uncontrolled access to these models if the mobile app was compromised. By shifting the IAM permissions and invocation handling to a central function, the team was able to increase visibility and control over how and when the FMs were invoked.</li> \n <li><strong>Change management</strong>: Over time, the underlying FM or prompt might need to change. If either was hard coded into the mobile app, any change would require a new release and every user would have to download the new app version. By locating this within the Lambda function, the specifics around model usage and prompt creation are decoupled and can be adapted without impacting users.&nbsp;</li> \n <li><strong>Monitoring</strong>: By routing requests through API Gateway and Lambda, the team can log and track metrics associated with usage. This enables better decision-making and reporting on how the app is performing.&nbsp;</li> \n <li><strong>Data optimization</strong>: By implementing the REST API and encapsulating the prompt and integration logic within the Lambda function, the team to can send the source word from the mobile app to the API. This means less data is sent over the cellular network to the backend services.&nbsp;</li> \n <li><strong>Caching layer</strong>: Although a caching layer wasn’t implemented within the system during the hackathon, the team considered the ability to implement a caching mechanism for source and related words that over time would reduce requests that need to be routed to Amazon Bedrock. This can be readily queried in the Lambda function as a preliminary step before submitting a prompt to an FM.</li> \n</ul> \n<h3>Prompt engineering</h3> \n<p>One of the core features of WordFinder is its ability to generate related words and concepts based on a user-provided source word. This source word (obtained from the mobile app through an API request) is embedded into the following prompt by the Lambda function, replacing <code>{word}:</code><br /><br /><code>prompt = \"I have Aphasia. Give me the top 10 most common words that are related words to the word supplied in the prompt context. Your response should be a valid JSON array of just the words. No surrounding context. {word}\"</code><br /><br />The team tested multiple different prompts and approaches during the hackathon, but this basic guiding prompt was found to give reliable, accurate, and repeatable results, regardless of the word supplied by the user.</p> \n<p>After the model responds, the Lambda function bundles the related words and returns them to the mobile app. Upon receipt of this data, the WordFinder app updates and displays the new list of words for the user who has aphasia. The user might then find their word, or drill deeper into other related words.</p> \n<p>To maintain efficient resource utilization and cost optimization, the architecture incorporates several resource cleanup mechanisms:</p> \n<ul> \n <li>Lambda automatic scaling: The Lambda function responsible for interacting with Amazon Bedrock is configured to automatically scale down to zero instances when not in use, minimizing idle resource consumption.</li> \n <li>Amazon S3 lifecycle policies: The S3 bucket storing the user-uploaded images is configured with lifecycle policies to automatically expire and delete objects after a specified retention period, freeing up storage space.&nbsp;</li> \n <li>API Gateway throttling and caching: API Gateway is configured with throttling limits to help prevent excessive requests, and caching mechanisms are implemented to reduce the load on downstream services such as Lambda and Amazon Bedrock.</li> \n</ul> \n<h2>Conclusion</h2> \n<p>The QARC team and Scott Harding worked closely with AWS to develop WordFinder, a mobile app that addresses communication challenges faced by individuals living with aphasia. Their winning entry at the 2023 AWS Queensland Hackathon showcased the power of involving those with lived experiences in the development process. Harding’s insights helped the tech team understand the nuances and impact of aphasia, leading to a solution that empowers users to find their words and stay connected.</p> \n<h2>References</h2> \n<ul> \n <li><a href=\"https://pages.awscloud.com/aws-ps-queensland-hackathon-2023.html\">AWS Queensland Hackathon 2023: Hack For Purpose</a></li> \n <li><a href=\"https://stories.uq.edu.au/contact-magazine/tech-hub-helps-people-with-aphasia-reclaim-their-independence/index.html\">Tech Hub helps people with aphasia reclaim their independence</a></li> \n <li><a href=\"https://shrs.uq.edu.au/qarc\">QARC – School of Health and Rehabilitation Services</a></li> \n <li><a href=\"https://aws.amazon.com/solutions/case-studies/generative-ai-qarc/\">AWS Case Study: Improving Communication and Speech for People Living with Aphasia</a></li> \n</ul> \n<hr /> \n<h3>About the Authors</h3> \n<p style=\"clear: both;\"><img alt=\"\" class=\"wp-image-104148 size-full alignleft\" height=\"118\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/09/ML-16892-Kori-Ramajoo_02-1.jpg\" width=\"100\" /><strong>Kori Ramijoo</strong> is a research speech pathologist at QARC. She has extensive experience in aphasia rehabilitation, technology, and neuroscience. Kori leads the Aphasia Tech Hub at QARC, enabling people with aphasia to access technology. She provides consultations to clinicians and provides advice and support to help people with aphasia gain and maintain independence. Kori is also researching design considerations for technology development and use by people with aphasia.</p> \n<p style=\"clear: both;\"><img alt=\"\" class=\"wp-image-104147 size-full alignleft\" height=\"133\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/09/ML-16892-Scott-20240628_151650.jpg\" width=\"100\" /><strong>Scott Harding</strong> lives with aphasia after a stroke. He has a background in Engineering and Computer Science. Scott is one of the Directors of the Australian Aphasia Association and is a consumer representative and advisor on various state government health committees and nationally funded research projects. He has interests in the use of AI in developing predictive models of aphasia recovery.</p> \n<p style=\"clear: both;\"><img alt=\"\" class=\"wp-image-104146 size-full alignleft\" height=\"123\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/09/ML-16892-Sonia-Brownsett.jpg\" width=\"100\" /><strong>Sonia Brownsett</strong> is a speech pathologist with extensive experience in neuroscience and technology. She has been a postdoctoral researcher at QARC and led the aphasia tech hub as well as a research program on the brain mechanisms underpinning aphasia recovery after stroke and in other populations including adults with brain tumours and epilepsy.</p> \n<p style=\"clear: both;\"><img alt=\"\" class=\"wp-image-104145 size-full alignleft\" height=\"100\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/09/ML-16892-DC-headshot-1.png\" width=\"100\" /><strong>David Copland</strong> is a speech pathologist and Director of QARC. He has worked for over 20 years in the field of aphasia rehabilitation. His work seeks to develop new ways to understand, assess and treat aphasia including the use of brain imaging and technology. He has led the creation of comprehensive aphasia treatment programs that are being implemented into health services.</p> \n<p style=\"clear: both;\"><img alt=\"\" class=\"wp-image-104149 size-full alignleft\" height=\"133\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/09/mpro.jpg\" width=\"100\" /><strong>Mark Promnitz</strong> is a Senior Solutions Architect at Amazon Web Services, based in Australia. In addition to helping his enterprise customers leverage the capabilities of AWS, he can often be found talking about Software as a Service (SaaS), data and cloud-native architectures on AWS.</p> \n<p style=\"clear: both;\"><img alt=\"\" class=\"wp-image-104150 size-full alignleft\" height=\"133\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/09/kurt.jpg\" width=\"100\" /><strong>Kurt Sterzl</strong> is a Senior Solutions Architect at Amazon Web Services, based in Australia.&nbsp; He enjoys working with public sector customers like UQ QARC to support their research breakthroughs.</p>",
    "source_feed": "https://aws.amazon.com/blogs/machine-learning/feed/",
    "scraped_at_iso": "2025-05-02T20:50:44Z",
    "filter_verdict": {
        "importance_level": "Interesting",
        "topic": "Health",
        "reasoning_summary": "The article reports on a concrete application of generative AI in healthcare, specifically aiding individuals with aphasia, which is a verifiable and significant use case.",
        "primary_topic_keyword": "AI for aphasia"
    },
    "filter_error": null,
    "filtered_at_iso": "2025-05-02T20:51:49Z",
    "topic": "Health",
    "is_breaking": false,
    "primary_keyword": "AI for aphasia",
    "selected_image_url": "https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/04/ML-16892WordFinder-app-Architecture.png",
    "seo_agent_results": {
        "generated_title_tag": "AI for Aphasia: AWS-Powered WordFinder App Boosts Communication",
        "generated_meta_description": "Discover how AWS generative AI powers WordFinder, an app helping people with aphasia communicate more independently. AI for aphasia innovation.",
        "generated_json_ld": "<script type=\"application/ld+json\">  \n{  \n  \"@context\": \"https://schema.org\",  \n  \"@type\": \"NewsArticle\",  \n  \"headline\": \"AI for Aphasia: AWS-Powered WordFinder App Boosts Communication\",  \n  \"description\": \"Discover how AWS generative AI powers WordFinder, an app helping people with aphasia communicate more independently. AI for aphasia innovation.\",  \n  \"keywords\": [\"AI for aphasia\"],  \n  \"mainEntityOfPage\": { \"@type\": \"WebPage\", \"@id\": \"https://aws.amazon.com/blogs/machine-learning/wordfinder-app-harnessing-generative-ai-on-aws-for-aphasia-communication/\" },  \n  \"image\": { \"@type\": \"ImageObject\", \"url\": \"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2025/04/04/ML-16892WordFinder-app-Architecture.png\" },  \n  \"datePublished\": \"2025-05-02T16:16:16Z\",  \n  \"author\": { \"@type\": \"Person\", \"name\": \"AI News Team\" },  \n  \"publisher\": {  \n    \"@type\": \"Organization\",  \n    \"name\": \"Dacoola\",  \n    \"logo\": { \"@type\": \"ImageObject\", \"url\": \"https://i.imgur.com/A5Wdp6f.png\" }  \n  }  \n}  \n</script>",
        "generated_article_body_md": "## WordFinder App: Harnessing Generative AI on AWS for Aphasia Communication  \n\nDeveloped by researchers from the Queensland Aphasia Research Centre (QARC) and AWS, the WordFinder app leverages **AI for aphasia** to assist individuals struggling with communication disabilities. The mobile app, born from the 2023 AWS Hack For Purpose event, uses generative AI to generate word lists from user-selected images, helping bridge language gaps for over 140,000 Australians affected by aphasia—a number expected to double by 2050.  \n\nThe app’s workflow begins with image recognition via Amazon Rekognition, which identifies objects in uploaded photos. AWS Lambda and Amazon Bedrock then expand these labels into semantically related words, offering users alternative ways to express themselves. For example, selecting an image of a koala might yield terms like \"marsupial\" or \"eucalyptus,\" aiding those who struggle with word retrieval. Built with React Native and Expo, WordFinder ensures cross-platform accessibility while AWS Amplify handles authentication and storage.  \n\n### Significance  \nBy integrating generative AI with real-world user insights—including input from Scott Harding, a person living with aphasia—WordFinder exemplifies how technology can empower marginalized communities. Its scalable AWS architecture, featuring API Gateway and lifecycle-managed S3 storage, ensures efficient, secure operation while reducing barriers to communication."
    },
    "seo_agent_error": null,
    "generated_tags": [
        "WordFinder app",
        "AI for aphasia",
        "AWS generative AI",
        "Amazon Rekognition",
        "Amazon Bedrock",
        "communication disabilities",
        "AWS Hack For Purpose",
        "Queensland Aphasia Research Centre",
        "React Native",
        "AWS Amplify"
    ],
    "tags_agent_error": null,
    "trend_score": 15.0,
    "slug": "wordfinder-app-harnessing-generative-ai-on-aws-for-aphasia-communication",
    "audio_url": null
}