{
    "id": "gyro-20250517170455479422-04430cfd3a",
    "original_source_url": "https://www.artificialintelligence-news.com/news/saudi-arabia-moves-to-build-its-ai-future-humain-and-nvidia/",
    "all_source_links_gyro": [
        "https://www.artificialintelligence-news.com/news/saudi-arabia-moves-to-build-its-ai-future-humain-and-nvidia/"
    ],
    "initial_title_from_web": "Saudi Arabia moves to build its AI future with HUMAIN and NVIDIA",
    "raw_scraped_text": "Saudi Arabia’s new state subsidiary, HUMAIN, is collaborating with NVIDIA to build AI infrastructure, nurture talent, and launch large-scale digital systems.\nThe effort includes plans to set up AI “factories” powered by up to 500 megawatts of energy. The sites will be filled with NVIDIA GPUs, including the Grace Blackwell GB300 supercomputers connected via NVIDIA’s InfiniBand network. The goal is to create a base for training models, running simulations, and managing complex AI deployments.\nA major part of the push is about control. Saudi Arabia wants to build sovereign AI – models trained using local data, language, and systems. By building its own infrastructure, it avoids relying on foreign cloud providers. The shift aligns with a broader trend, as governments around the world start to question how AI tools are built, where data goes, and who controls it.\nHUMAIN is meant to give Saudi Arabia more say in that process. While other countries have launched national AI strategies, HUMAIN stands out for its structure. It’s not just a policy office or research fund; instead, it operates across the full AI value chain – building data centres, managing data, training models, and deploying applications. Few countries have a single body doing likewise with such a broad remit.\nSingapore’s NAIS 2.0, for example, focuses on public sector use cases and talent development, and the UAE’s approach, which emphasises frameworks and governance. China has set up AI labs in several cities, but they tend to work in silos. HUMAIN brings elements together with a central goal: make Saudi Arabia a producer, not just a user, of AI.\nThe ambition is clear, but it comes with trade-offs. Running GPU-heavy data centres on this scale will use a lot of power. The 500-megawatt figure is far beyond typical enterprise deployments. Globally, the environmental cost of AI has become a growing concern. Microsoft and Google have both reported rising emissions from AI-related infrastructure. Saudi Arabia will need to explain how its AI factories will be powered – especially if it wants to align with its own sustainability targets under Vision 2030.\nThe partnership with NVIDIA isn’t just about machines, it also includes training for people. HUMAIN and NVIDIA say they will run large-scale education programmes to help thousands of Saudi developers gain skills in AI, robotics, simulation, and digital twins. Building local talent is a core part of the effort, and without it, infrastructure likely won’t get used to its full potential.\n“AI, like electricity and internet, is essential infrastructure for every nation,” said Jensen Huang, founder and CEO of NVIDIA. “Together with HUMAIN, we are building AI infrastructure for the people and companies of Saudi Arabia to realise the bold vision of the Kingdom.”\nOne of the tools HUMAIN plans to deploy is NVIDIA Omniverse, to be used as a multi-tenant platform for industries like logistics, manufacturing, and energy. These sectors could create digital twins – virtual versions of real systems – to test, monitor, and improve operations. The idea is simple: simulate before you build, or run stress tests in digital form to save time and money later.\nThis type of simulation and optimisation supports Saudi Arabia’s broader push into automation and smart industry. It fits in a wider narrative of transitioning from oil to advanced tech as a core pillar of the economy.\nThe deal fits into NVIDIA’s global strategy, and the company has similar partnerships in India, the UAE, and Europe. Saudi Arabia offers strong government support, deep funding, and the promise to become a new AI hub in the Middle East. In return, NVIDIA provides the technical backbone – GPUs, software platforms, and the know-how to run them.\nThe partnership helps both sides. Saudi Arabia gets the tools to build AI from the ground up and build a new economic version of itself, while NVIDIA gains a long-term customer and a foothold in a growing market.\nThere are still gaps to watch. How will HUMAIN govern the use of its models? Will they be open for researchers and startups, or tightly controlled by the state? What role will local universities or private companies play? And can workforce development keep pace with the rapid buildout of infrastructure?\nHUMAIN isn’t just building for now. The structure suggests a long-term bet – one that links compute power, national priorities, and a shift in how AI is developed and deployed. Saudi Arabia wants more than access. It wants influence. And HUMAIN, in partnership with NVIDIA, is the engine it’s building to get there.\n(Photo by Mariia Shalabaieva)\nSee also: Huawei’s AI hardware breakthrough challenges Nvidia’s dominance\nWant to learn more about AI and big data from industry leaders? Check out AI & Big Data Expo taking place in Amsterdam, California, and London. The comprehensive event is co-located with other leading events including Intelligent Automation Conference, BlockX, Digital Transformation Week, and Cyber Security & Cloud Expo.\nExplore other upcoming enterprise technology events and webinars powered by TechForge here.",
    "research_topic": "Gyro Pick - Quick",
    "retrieved_at": "2025-05-17T17:05:03.009876+00:00",
    "is_gyro_pick": true,
    "gyro_pick_mode": "Quick",
    "user_importance_override_gyro": null,
    "user_is_trending_pick_gyro": null,
    "user_provided_image_url_gyro": null,
    "selected_image_url": "https://www.cryptoninjas.net/wp-content/uploads/In-the-center-Saudi-Arabian-people-and-NVIDIA-is%E2%80%A6.jpeg",
    "author": "Gyro Pick Team",
    "published_iso": "2025-05-17T17:05:03.009900+00:00"
}