{
    "id": "gyro-20250517170504013771-6cc4df06f1",
    "original_source_url": "https://spectrum.ieee.org/video-friday-darpa-triage-challenge",
    "all_source_links_gyro": [
        "https://spectrum.ieee.org/video-friday-darpa-triage-challenge"
    ],
    "initial_title_from_web": "Robot Videos: Battlefield Triage, Firefighting Drone, and More - IEEE Spectrum",
    "raw_scraped_text": "Video Friday is your weekly selection of awesome robotics videos, collected by your friends at IEEE Spectrum robotics. We also post a weekly calendar of upcoming robotics events for the next few months. Please send us your events for inclusion.\nICRA 2025: 19–23 May 2025, ATLANTA, GA\nLondon Humanoids Summit: 29–30 May 2025, LONDON\nIEEE RCAR 2025: 1–6 June 2025, TOYAMA, JAPAN\n2025 Energy Drone & Robotics Summit: 16–18 June 2025, HOUSTON\nRSS 2025: 21–25 June 2025, LOS ANGELES\nETH Robotics Summer School: 21–27 June 2025, GENEVA\nIAS 2025: 30 June–4 July 2025, GENOA, ITALY\nICRES 2025: 3–4 July 2025, PORTO, PORTUGAL\nIEEE World Haptics: 8–11 July 2025, SUWON, SOUTH KOREA\nIFAC Symposium on Robotics: 15–18 July 2025, PARIS\nRoboCup 2025: 15–21 July 2025, BAHIA, BRAZIL\nRO-MAN 2025: 25–29 August 2025, EINDHOVEN, THE NETHERLANDS\nCLAWAR 2025: 5–7 September 2025, SHENZHEN, CHINA\nCoRL 2025: 27–30 September 2025, SEOUL\nIEEE Humanoids: 30 September–2 October 2025, SEOUL\nWorld Robot Summit: 10–12 October 2025, OSAKA, JAPAN\nIROS 2025: 19–25 October 2025, HANGZHOU, CHINA\nEnjoy today’s videos!\nBehind the scenes at DARPA Triage Challenge Workshop 2 at the Guardian Centers in Perry, Ga.\n[ DARPA ]\nWatch our coworker in action as he performs high-precision stretch routines enabled by 31 degrees of freedom. Designed for dynamic adaptability, this is where robotics meets real-world readiness.\n[ LimX Dynamics ]\nThanks, Jinyan!\nFeaturing a lightweight design and continuous operation capabilities under extreme conditions, LYNX M20 sets a new benchmark for intelligent robotic platforms working in complex scenarios.\n[ DEEP Robotics ]\nThe sound in this video is either excellent or terrible, I’m not quite sure which.\n[ TU Berlin ]\nHumanoid loco-manipulation holds transformative potential for daily service and industrial tasks, yet achieving precise, robust whole-body control with 3D end-effector force interaction remains a major challenge. Prior approaches are often limited to lightweight tasks or quadrupedal/wheeled platforms. To overcome these limitations, we propose FALCON, a dual-agent reinforcement-learning-based framework for robust force-adaptive humanoid loco-manipulation.\n[ FALCON ]\nAn MRSD Team at the CMU Robotics Institute is developing a robotic platform to map environments through perceptual degradation, identify points of interest, and relay that information back to first responders. The goal is to reduce information blindness and increase safety.\n[ Carnegie Mellon University ]\nWe introduce an eldercare robot (E-BAR) capable of lifting a human body, assisting with postural changes/ambulation, and catching a user during a fall, all without the use of any wearable device or harness. With a minimum width of 38 centimeters, the robot’s small footprint allows it to navigate the typical home environment. We demonstrate E-BAR’s utility in multiple typical home scenarios that elderly persons experience, including getting into/out of a bathtub, bending to reach for objects, sit-to-stand transitions, and ambulation.\n[ MIT ]\nSanctuary AI had the pleasure of accompanying Microsoft to Hannover Messe, where we demonstrated how our technology is shaping the future of work with autonomous labor powered by physical AI and general-purpose robots.\n[ Sanctuary AI ]\nWatch how drywall finishing machines incorporate collaborative robots, and learn why Canvas chose the Universal Robots platform.\n[ Canvas ] via [ Universal Robots ]\nWe’ve officially put a stake in the ground in Dallas–Fort Worth. Torc’s new operations hub is open for business—and it’s more than just a dot on the map. It’s a strategic launchpad as we expand our autonomous freight network across the southern United States.\n[ Torc ]\nThis Stanford Robotics Center talk is by Jonathan Hurst at Agility Robotics, on “Humanoid Robots: From the Warehouse to Your House.”\nHow close are we to having safe, reliable, useful in-home humanoids? If you believe recent press, it’s just around the corner. Unquestionably, advances in Al and robotics are driving innovation and activity in the sector; it truly is an exciting time to be building robots! But what does it really take to execute on the vision of useful, human-centric, multipurpose robots? Robots that can operate in human spaces, predictably and safely? We think it starts with humanoids in warehouses, an unsexy but necessary beachhead market to our future with robots as part of everyday life. I’ll talk about why a humanoid is more than a sensible form factor, it’s inevitable; and I will speak to the excitement around a ChatGPT moment for robotics, and what it will take to leverage Al advances and innovation in robotics into useful, safe humanoids.\n[ Stanford ]\n- How JPL's Team CoSTAR Won the DARPA SubT Challenge: Urban Circuit Systems Track ›\n- Video Friday: Reachy 2 ›\nEvan Ackerman is a senior editor at IEEE Spectrum. Since 2007, he has written over 6,000 articles on robotics and technology. He has a degree in Martian geology and is excellent at playing bagpipes.",
    "research_topic": "Gyro Pick - Quick",
    "retrieved_at": "2025-05-17T17:05:04.461155+00:00",
    "is_gyro_pick": true,
    "gyro_pick_mode": "Quick",
    "user_importance_override_gyro": null,
    "user_is_trending_pick_gyro": null,
    "user_provided_image_url_gyro": null,
    "selected_image_url": "https://spectrum.ieee.org/media-library/image.png?id=60250560&width=1200&height=600&coordinates=0%2C60%2C0%2C60",
    "author": "Gyro Pick Team",
    "published_iso": "2025-05-17T17:05:04.461163+00:00"
}