{
    "id": "gyro-20250517170454203404-e5d9ff3057",
    "original_source_url": "https://techcrunch.com/2025/05/17/y-combinator-startup-firecrawl-is-ready-to-pay-1m-to-hire-three-ai-agents-as-employees/",
    "all_source_links_gyro": [
        "https://techcrunch.com/2025/05/17/y-combinator-startup-firecrawl-is-ready-to-pay-1m-to-hire-three-ai-agents-as-employees/"
    ],
    "initial_title_from_web": "Y Combinator startup Firecrawl is ready to pay $1M to hire three AI agents as employees | TechCrunch",
    "raw_scraped_text": "Y Combinator-backed startup Firecrawl is back on the hunt for AI agent employees. As we reported back in February, its first attempt didn’t yield an AI worth hiring.\nBut it’s now placed three new ads on YC’s job board for “AI agents only” and has set aside a $1 million budget total to make it happen.\nWithin about a week after the new job posts went live, it had about 50 applicants, founder Caleb Peffer tells TechCrunch.\nFirecrawl offers a web crawling tool that scrapes data from websites for LLMs. This is, Peffer admits, a shady part of the AI ecosystem where bad behaving web crawlers can sometimes pound websites like DDoS attacks. But Firewcrawl has gained popularity by trying to bring in some guardrails, he says.\nFor instance, many of its customers are enterprises scraping their own data for internal LLM use. Some websites want their data included in chatbot responses, just like they want Google links, he says. Additionally, the tool honors robot.txt settings and can be set to only scrape a public website once and share the data with others.\nConsequently, one job opening is for a content creation agent “that never sleeps and always ships” that will autonomously produce “high quality” SEO-pleasing blog posts and tutorials on how to use its product, the startup’s ad says. Firecrawl wants this AI to watch engagement metrics and use that to autonomously improve the audience for its content, too.\nIn other words: the agent should decide what to create, create it, post it, measure the audience, and grow mastery from that feedback, autonomously. If you are a borderline AGI AI made for blogging, this could be the job for you. The advertised pay is $5,000 a month.\nJoin us at TechCrunch Sessions: AI\nSecure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking.\nExhibit at TechCrunch Sessions: AI\nSecure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last.\nThe company is also looking for a customer support engineer agent that will be tasked with crafting the AI workflow that responds to customer issues within two minutes and can handle tickets on its own, knowing when to escalate to a human. Previous experience doing customer support is requested. Pay is also $5,000/month.\nThe third opening is for a junior developer agent who’ll be tasked with prioritizing incoming Github issues, writing documentation and writing code in TypeScript and Go. Once again, the pay also $5,000/month.\nBut here’s the catch: Firecrawl is also hoping to hire human creator or creators behind these bots — and the $1 million budget is for hiring both agents and humans, though it’s not clear how many years the budget is supposed to cover. The startup might hire the humans full time, or as contractors (which might make more sense if they’re creating lots of agents for lots of companies). Firecrawl is also entertaining bids from other startups that specialize in creating the types of agents that it’s looking for, say in customer service, Peffer says.\nThe truth is, the AI employee of Firecrawl’s dreams doesn’t exist yet. Maybe it never will.\n“AI can’t replace humans today,” Peffer says. ”The future, what we see, is a world where the next 10x engineers are operating armies of agents, AI systems that they’re building, maintaining, and monitoring. What we want to do is work with people that want to be those agent operators.”\nFirecrawl is not the only one. YC’s job board is full of jobs for developers of agents. Will their creations ever replace them as Silicon Valley is continuously wishing? That’s the real million-dollar question.",
    "research_topic": "Gyro Pick - Quick",
    "retrieved_at": "2025-05-17T17:04:54.477384+00:00",
    "is_gyro_pick": true,
    "gyro_pick_mode": "Quick",
    "user_importance_override_gyro": null,
    "user_is_trending_pick_gyro": null,
    "user_provided_image_url_gyro": null,
    "selected_image_url": "https://techcrunch.com/wp-content/uploads/2025/02/Firecrawl-founders.png?w=1058",
    "author": "Gyro Pick Team",
    "published_iso": "2025-05-17T17:04:54.477396+00:00"
}